{
  "summary": "Chapter 10, titled 'How to Find and Fix the Causes of Your Bad Habits,' explores the underlying motives behind habits and how to change them. It highlights that habits often start with friends and can be broken by reframing cues and associations. The chapter references Alan Carr's book on quitting smoking, which systematically reframes cues associated with smoking, giving them new meanings and making the habit unattractive. Every behavior stems from a surface-level craving and a deeper underlying motive, with habits acting as modern-day solutions to ancient desires. Current habits may not be the best solutions to problems, and the cause of habits lies in the predictions preceding them. Cravings indicate something is missing and represent a desire to change one's internal state. Hard habits can become more attractive by associating them with positive experiences, which includes reframing tasks as opportunities. Motivation can be enhanced by associating habits with enjoyable activities, using them as cues. Reframing associations is key to fixing bad habits, and reprogramming predictions can transform difficult habits into attractive ones.",
  "evidence": [
    {
      "verbatim_text": "[02:47:22,775,02:47:26,578] Chapter 10, How to Find and Fix the Causes of Your Bad Habits."
    },
    {
      "verbatim_text": "[02:48:04,183,02:48:08,827] I asked one of the Turks how he got started. Friends, he said. It always starts with your friends."
    },
    {
      "verbatim_text": "[02:48:16,359,02:48:24,123] Mike had been smoke-free for a few years at that point, and he swore up and down that he broke the habit because of a book called Alan Carr's Easy Way to Stop Smoking."
    },
    {
      "verbatim_text": "[02:48:25,404,02:48:29,586] It frees you from the mental burden of smoking, he said. It tells you, stop lying to yourself."
    },
    {
      "verbatim_text": "[02:48:47,543,02:48:52,046] He systematically reframes each cue associated with smoking and gives it a new meaning."
    },
    {
      "verbatim_text": "[02:48:52,727,02:48:58,170] He says things like, you think you're quitting smoking, but you're not quitting anything because cigarettes do nothing for you."
    },
    {
      "verbatim_text": "[02:49:38,058,02:49:42,040] It is an inversion of the second law of behavior change. Make it unattractive."
    },
    {
      "verbatim_text": "[02:49:50,683,02:49:56,765] Where Cravings Come From Every behavior has a surface-level craving and a deeper, underlying motive."
    },
    {
      "verbatim_text": "[02:50:30,591,02:55:38,055] To summarize, the specific cravings you feel and the habits you perform are really an attempt to address your fundamental underlying motives."
    },
    {
      "verbatim_text": "[02:51:30,077,02:51:34,779] Your habits are modern-day solutions to ancient desires, new versions of old vices."
    },
    {
      "verbatim_text": "[02:51:55,557,02:51:59,258] Your current habits are not necessarily the best way to solve the problems you face."
    },
    {
      "verbatim_text": "[02:53:39,670,02:53:42,693] The cause of your habits is actually the prediction that precedes them."
    },
    {
      "verbatim_text": "[02:54:26,556,02:54:31,558] A craving is the sense that something is missing. It is the desire to change your internal state."
    },
    {
      "verbatim_text": "[02:56:05,852,02:56:10,437] You can make hard habits more attractive if you can learn to associate them with a positive experience."
    },
    {
      "verbatim_text": "[02:56:26,290,02:56:32,615] You don't have to, you get to. You get to wake up early for work. You get to make another sales call for your business."
    },
    {
      "verbatim_text": "[02:57:13,273,02:57:22,397] Similarly, reframing your habits to highlight their benefits rather than their drawbacks is a fast and lightweight way to reprogram your mind and make a habit seem more attractive."
    },
    {
      "verbatim_text": "[02:58:58,342,02:59:05,447] You simply associate your habits with something that you already enjoy, and then you use that as the cue whenever you need a little bit of motivation."
    },
    {
      "verbatim_text": "[03:01:05,695,03:01:10,997] The key to finding and fixing the causes of your bad habits is to reframe the associations you have about them."
    },
    {
      "verbatim_text": "[03:01:12,057,03:01:17,659] It's not easy, but if you can reprogram your predictions, you can transform a hard habit into an attractive one."
    }
  ],
  "start_index": 1699,
  "end_index": 1871
}