{
  "summary": "This chapter discusses how habits shape identity and vice versa, addressing why bad habits are easy to repeat and good habits are hard to form. Improving daily habits can significantly impact one's life, yet maintaining good habits often proves difficult. Changing habits is challenging because people often try to change the wrong thing or in the wrong way. Change occurs at three levels: outcomes, processes, and identity. Outcomes concern results, processes involve habits and systems, and identity relates to beliefs and self-image. Many start by focusing on outcomes, leading to outcome-based habits, while identity-based habits focus on who one wishes to become. Behind actions lies a belief system, and behavior incongruent with one's self-image is unsustainable. Changing underlying beliefs is crucial for lasting habit change. Pride in one's identity motivates maintaining associated habits. True behavior change involves identity change, with habits becoming part of one's identity. However, attachment to a particular identity can hinder change, and identity conflict poses a significant barrier. Identity emerges from habits; habits embody identity. Identity is literally one's repeated beingness. Habits pave the way for identity change. Changing what one does is the most practical way to change who one is. The process involves deciding the type of person one wants to be and proving it through small wins. Identity change serves as the guiding principle for habit change.",
  "evidence": [
    {
      "verbatim_text": "[00:42:30,528,00:42:41,020] Chapter 2 How Your Habits Shape Your Identity, and Vice Versa Why is it so easy to repeat bad habits and so hard to form good ones?"
    },
    {
      "verbatim_text": "[00:42:42,081,00:42:46,086] Few things can have a more powerful impact on your life than improving your daily habits."
    },
    {
      "verbatim_text": "[00:43:23,478,00:43:25,499] Changing our habits is challenging for two reasons."
    },
    {
      "verbatim_text": "[00:43:26,239,00:43:31,521] One, we try to change the wrong thing, and two, we try to change our habits in the wrong way."
    },
    {
      "verbatim_text": "[00:43:56,865,00:43:58,968] The first layer is changing your outcomes."
    },
    {
      "verbatim_text": "[00:44:11,504,00:44:14,065] This level is concerned with changing your habits and systems."
    },
    {
      "verbatim_text": "[00:44:21,527,00:44:27,749] Most of the habits you build are associated with this level. The third and deepest layer is changing your identity."
    },
    {
      "verbatim_text": "[00:44:41,763,00:44:47,386] Outcomes are about what you get. Processes are about what you do. Identity is about what you believe."
    },
    {
      "verbatim_text": "[00:45:02,919,00:45:07,641] Many people begin the process of changing their habits by focusing on what they want to achieve."
    },
    {
      "verbatim_text": "[00:45:14,164,00:45:17,585] With this approach, we start by focusing on who we wish to become."
    },
    {
      "verbatim_text": "[00:46:24,288,00:46:26,990] Behind every system of actions are a system of beliefs."
    },
    {
      "verbatim_text": "[00:47:07,061,00:47:09,923] Behavior that is incongruent with the self will not last."
    },
    {
      "verbatim_text": "[00:47:27,270,00:47:31,811] It's hard to change your habits if you never change the underlying beliefs that led to your past behavior."
    },
    {
      "verbatim_text": "[00:49:14,989,00:49:17,090] True behavior change is identity change."
    },
    {
      "verbatim_text": "[00:49:38,857,00:49:50,762] The goal is not to read a book. The goal is to become a reader. The goal is not to run a marathon.\nThe goal is to become a runner. The goal is not to learn an instrument. The goal is to become a musician."
    },
    {
      "verbatim_text": "[00:50:51,135,00:50:56,480] Once you have adopted an identity, it can be easy to let your allegiance to it impact your ability to change."
    },
    {
      "verbatim_text": "[00:51:57,103,00:52:03,008] The biggest barrier to positive change at any level—individual, team, society—is identity conflict."
    },
    {
      "verbatim_text": "[00:52:24,074,00:52:29,296] This is why you can't get too attached to one version of your identity. Progress requires unlearning."
    },
    {
      "verbatim_text": "[00:52:55,750,00:53:01,535] The two-step process to changing your identity Your identity emerges out of your habits."
    },
    {
      "verbatim_text": "[00:53:31,140,00:53:35,582] To put it more precisely, your habits are how you embody your identity."
    },
    {
      "verbatim_text": "[00:53:59,199,00:54:02,285] Your identity is literally your repeated beingness."
    },
    {
      "verbatim_text": "[00:56:28,936,00:56:32,899] Putting this all together, you can see that habits are the path to changing your identity."
    },
    {
      "verbatim_text": "[00:57:46,688,00:57:52,970] One, decide the type of person you want to be. Two, prove it to yourself with small wins."
    },
    {
      "verbatim_text": "[01:00:04,129,01:00:09,550] The Real Reason Habits Matter Identity change is the north star of habit change."
    }
  ],
  "start_index": 418,
  "end_index": 624
}