{
  "summary": "This chapter from \"Atomic Habits\" discusses how to make habits irresistible by understanding motivation and cravings. It introduces the concept of supernormal stimuli through the work of Nico Tinbergen, who discovered that animals are highly responsive to exaggerated versions of cues. For example, herring gull chicks peck more vigorously at beaks with larger red spots, and gray-legged geese will try to roll oversized round objects into their nests. The chapter extends this concept to human behavior, noting how the modern food industry creates hyperpalatable foods high in salt, sugar, and fat, which act as supernormal stimuli, driving overeating. These foods, enhanced with dynamic contrast and optimized oro-sensation, exploit our evolutionary instincts, making them hard to resist. Similarly, society is filled with engineered versions of reality, such as mannequins, social media, online pornography, and advertisements, that exaggerate attractive features and drive excessive habits. The chapter also delves into the role of dopamine in habit formation, explaining that dopamine is released not only when experiencing pleasure but also in anticipation of it, driving motivation and craving. Experiments with rats showed that blocking dopamine eliminates desire, while flooding the brain with dopamine leads to rapid habit formation. The chapter introduces temptation bundling, a strategy to make habits more attractive by linking desired actions with needed actions. Ronan Byrne, for example, linked watching Netflix with cycling on a stationary bike. Businesses also use temptation bundling, as seen with ABC's TGIT campaign, which associated watching their shows with relaxing, drinking wine, and eating popcorn. This strategy leverages the Premack Principle, where more probable behaviors reinforce less probable ones, making new habits more appealing.",
  "evidence": [
    {
      "verbatim_text": "[02:14:26,717,02:14:34,781] In the 1940s, a Dutch scientist named Nico Tinbergen performed a series of experiments that transformed our understanding of what motivates us."
    },
    {
      "verbatim_text": "[02:14:35,762,02:14:44,987] Tinbergen, who eventually won a Nobel prize for his work, was investigating herring gulls, the gray and white birds often seen flying along the seashores of North America."
    },
    {
      "verbatim_text": "[02:14:46,344,02:14:53,951] Adult herring gulls have a small red dot on their beak, and Tinbergen noticed that newly hatched chicks would peck at this spot whenever they wanted food."
    },
    {
      "verbatim_text": "[02:15:07,063,02:15:11,167] The beaks were obvious fakes, and he assumed the baby birds would reject them altogether."
    },
    {
      "verbatim_text": "[02:15:12,150,02:15:18,494] However, when the tiny gulls saw the red spot on the cardboard beaks, they pecked away just as if it were attached to their own mother."
    },
    {
      "verbatim_text": "[02:15:25,498,02:15:30,300] Soon, Tinbergen discovered that the bigger the red spot, the faster the chicks pecked."
    },
    {
      "verbatim_text": "[02:15:35,984,02:15:39,546] When he placed it over the nest, the baby birds went crazy with delight."
    },
    {
      "verbatim_text": "[02:15:40,284,02:15:43,966] They pecked at the little red patches as if it was the greatest beak they had ever seen."
    },
    {
      "verbatim_text": "[02:15:49,030,02:15:51,872] For example, the gray-legged goose is a ground-nesting bird."
    },
    {
      "verbatim_text": "[02:15:52,392,02:15:57,936] Occasionally, as the mother moves around on the nest, one of the eggs will roll out and settle on the grass nearby."
    },
    {
      "verbatim_text": "[02:16:05,512,02:16:11,834] Tinbergen discovered that the goose will pull any nearby round object, such as a billiard ball or a light bulb, back into the nest."
    },
    {
      "verbatim_text": "[02:16:12,414,02:16:14,574] The bigger the object, the greater their response."
    },
    {
      "verbatim_text": "[02:16:15,455,02:16:19,036] One goose even made a tremendous effort to roll a volleyball back and sit on top."
    },
    {
      "verbatim_text": "[02:16:19,976,02:16:25,277] Like the baby gulls automatically pecking at red dots, the gray-legged goose was following an instinctive rule."
    },
    {
      "verbatim_text": "[02:16:25,937,02:16:29,078] When I see a round object nearby, I must roll it back into the nest."
    },
    {
      "verbatim_text": "[02:16:29,538,02:16:32,039] The bigger the round object, the harder I should try to get it."
    },
    {
      "verbatim_text": "[02:16:42,647,02:16:46,531] Scientists refer to these exaggerated cues as supernormal stimuli."
    },
    {
      "verbatim_text": "[02:16:47,371,02:16:56,199] A supernormal stimulus is a heightened version of reality, like a beak with three red dots or an egg the size of a volleyball, and it elicits a stronger response than usual."
    },
    {
      "verbatim_text": "[02:17:01,068,02:17:04,511] Junk food, for example, drives our reward systems into a frenzy."
    },
    {
      "verbatim_text": "[02:17:05,252,02:17:13,359] After spending hundreds of thousands of years hunting and foraging for food in the wild, the human brain has evolved to place a high value on salt, sugar, and fat."
    },
    {
      "verbatim_text": "[02:17:26,548,02:17:29,230] Today, however, we live in a calorie-rich environment."
    },
    {
      "verbatim_text": "[02:17:29,650,02:17:33,012] Food is abundant, but your brain continues to crave it like it is scarce."
    },
    {
      "verbatim_text": "[02:17:45,078,02:17:50,221] The modern food industry relies on stretching our paleolithic instincts beyond their evolutionary purpose."
    },
    {
      "verbatim_text": "[02:17:51,257,02:17:55,640] A primary goal of food science is to create products that are more attractive to consumers."
    },
    {
      "verbatim_text": "[02:17:56,781,02:18:02,164] Nearly every food in a bag, box, or jar has been enhanced in some way, if only with additional flavoring."
    },
    {
      "verbatim_text": "[02:18:03,265,02:18:09,729] Companies spend millions of dollars to discover the most satisfying level of crunch in a potato chip, or the perfect amount of fizz in a soda."
    },
    {
      "verbatim_text": "[02:18:10,630,02:18:16,474] Entire departments are dedicated to optimizing how a product feels in your mouth, a quality known as oro-sensation."
    },
    {
      "verbatim_text": "[02:18:17,326,02:18:23,893] French fries, for example, are a potent combination, golden brown and crunchy on the outside, light and smooth on the inside."
    },
    {
      "verbatim_text": "[02:18:25,154,02:18:31,822] Other processed foods enhance dynamic contrast, which refers to items with a combination of sensations, like crunchy and creamy."
    },
    {
      "verbatim_text": "[02:18:32,582,02:18:39,390] Imagine the gooeyness of melted cheese on top of a crispy pizza crust, or the crunch of an Oreo cookie combined with its smooth center."
    },
    {
      "verbatim_text": "[02:18:40,405,02:18:45,289] With natural, unprocessed foods, you tend to experience the same sensations over and over."
    },
    {
      "verbatim_text": "[02:18:52,775,02:18:58,039] But foods that are high in dynamic contrast keep the experience novel and interesting, encouraging you to eat more."
    },
    {
      "verbatim_text": "[02:18:59,240,02:19:08,887] Ultimately, such strategies enable food scientists to find the bliss point for each product, which is the precise combination of salt, sugar, and fat that excites your brain and keeps you coming back for more."
    },
    {
      "verbatim_text": "[02:19:09,649,02:19:14,833] The result, of course, is that you overeat because hyperpalatable foods are more attractive to the human brain."
    },
    {
      "verbatim_text": "[02:19:15,914,02:19:23,019] As Stephane Guillén, a neuroscientist who specializes in eating behavior and obesity, says, we've gotten too good at pushing our own buttons."
    },
    {
      "verbatim_text": "[02:19:38,210,02:19:44,333] Society is filled with highly engineered versions of reality that are more attractive than the world our ancestors evolved in."
    },
    {
      "verbatim_text": "[02:19:45,033,02:19:48,775] Stores feature mannequins with exaggerated hips and breasts to sell clothes."
    },
    {
      "verbatim_text": "[02:19:49,375,02:19:54,377] Social media delivers more likes and praise in a few minutes than we could ever get in the office or at home."
    },
    {
      "verbatim_text": "[02:19:55,038,02:20:00,080] Online porn splices together stimulating scenes at a rate that would be impossible to replicate in real life."
    },
    {
      "verbatim_text": "[02:20:00,883,02:20:05,985] Advertisements are created with a combination of ideal lighting, professional makeup, and photoshopped edits."
    },
    {
      "verbatim_text": "[02:20:06,665,02:20:13,067] Even the model doesn't look like the person in the final image. These are the supernormal stimuli of our modern world."
    },
    {
      "verbatim_text": "[02:20:13,908,02:20:25,072] They exaggerate features that are naturally attractive to us, and our instincts go wild as a result, driving us into excessive shopping habits, social media habits, porn habits, eating habits, and many others."
    },
    {
      "verbatim_text": "[02:20:37,318,02:20:40,581] Junk food is a more concentrated form of calories than natural food."
    },
    {
      "verbatim_text": "[02:20:41,181,02:20:44,184] Hard liquor is a more concentrated form of alcohol than beer."
    },
    {
      "verbatim_text": "[02:20:44,785,02:20:48,048] Video games are a more concentrated form of play than board games."
    },
    {
      "verbatim_text": "[02:20:53,133,02:20:56,777] We have the brains of our ancestors, but temptations they never had to face."
    },
    {
      "verbatim_text": "[02:21:27,707,02:21:35,852] The Dopamine-Driven Feedback Loop Scientists can track the precise moment a craving occurs by measuring a neurotransmitter called dopamine."
    },
    {
      "verbatim_text": "[02:21:52,259,02:22:01,182] However, I will single out dopamine in this chapter because it provides a window into the biological underpinnings of desire, craving, and motivation that are behind every habit."
    },
    {
      "verbatim_text": "[02:22:02,483,02:22:12,987] The importance of dopamine became apparent in 1954 when the neuroscientists James Olds and Peter Milner ran an experiment that revealed the neurological processes behind craving and desire."
    },
    {
      "verbatim_text": "[02:22:19,459,02:22:22,722] To the surprise of the scientists, the rats lost all will to live."
    },
    {
      "verbatim_text": "[02:22:23,202,02:22:28,907] They wouldn't eat, they wouldn't have sex, they didn't crave anything. Within a few days, the animals died of thirst."
    },
    {
      "verbatim_text": "[02:22:46,073,02:22:53,039] Even though dopamine was blocked, the rats still liked sugar just as much as before, they just didn't want it anymore."
    },
    {
      "verbatim_text": "[02:22:53,960,02:23:01,126] The ability to experience pleasure remained, but without dopamine, desire died, and without desire, action stopped."
    },
    {
      "verbatim_text": "[02:23:02,440,02:23:09,763] When other researchers reversed this process and flooded the reward system of the brain with dopamine, animals performed habits at breakneck speed."
    },
    {
      "verbatim_text": "[02:23:15,307,02:23:17,229] The wanting centers in the brain are large."
    },
    {
      "verbatim_text": "[02:23:29,055,02:23:31,378] Habits are a dopamine-driven feedback loop."
    },
    {
      "verbatim_text": "[02:23:32,038,02:23:40,548] Every behavior that is highly habit-forming—taking drugs, eating junk food, playing video games, browsing social media—is associated with higher levels of dopamine."
    },
    {
      "verbatim_text": "[02:24:05,283,02:24:10,906] Dopamine is released not only when you experience pleasure, but also when you anticipate it."
    },
    {
      "verbatim_text": "[02:24:11,732,02:24:16,195] Gambling addicts have a dopamine spike right before they place a bet, not after they win."
    },
    {
      "verbatim_text": "[02:24:16,755,02:24:20,998] Cocaine addicts get a surge of dopamine when they see the powder, not after they take it."
    },
    {
      "verbatim_text": "[02:24:21,679,02:24:27,583] Whenever you predict that an opportunity will be rewarding, your levels of dopamine spike in anticipation."
    },
    {
      "verbatim_text": "[02:24:28,183,02:24:31,285] And whenever dopamine rises, so does your motivation to act."
    },
    {
      "verbatim_text": "[02:24:31,925,02:24:37,189] It is the anticipation of a reward, not the fulfillment of it, that gets us to take action."
    },
    {
      "verbatim_text": "[02:24:49,008,02:24:53,789] This is one reason the anticipation of an experience can often feel better than the attainment of it."
    },
    {
      "verbatim_text": "[02:25:04,811,02:25:08,232] Scientists refer to this as the difference between wanting and liking."
    },
    {
      "verbatim_text": "[02:25:09,562,02:25:14,627] Your brain has far more neural circuitry allocated for wanting rewards than for liking them."
    },
    {
      "verbatim_text": "[02:25:53,886,02:25:59,809] Desire is the engine that drives behavior. Every action is taken because of the anticipation that precedes it."
    },
    {
      "verbatim_text": "[02:26:00,009,02:26:02,090] It is the craving that leads to the response."
    },
    {
      "verbatim_text": "[02:26:06,633,02:26:14,021] We need to make our habits attractive because it is the expectation of a rewarding experience that motivates us to act in the first place."
    },
    {
      "verbatim_text": "[02:26:14,741,02:26:18,085] This is where a strategy known as temptation bundling comes into play."
    },
    {
      "verbatim_text": "[02:27:01,867,02:27:06,510] Temptation bundling works by linking an action you want to do with an action you need to do."
    },
    {
      "verbatim_text": "[02:27:07,550,02:27:14,054] In Burns' case, he bundled watching Netflix, the thing he wanted to do, with riding a stationary bike, the thing he needed to do."
    },
    {
      "verbatim_text": "[02:27:15,092,02:27:17,193] Businesses are masters at temptation bundling."
    },
    {
      "verbatim_text": "[02:27:32,499,02:27:39,702] Every Thursday, the company would air three shows created by screenwriter Shonda Rhimes, Grey's Anatomy, Scandal, and How to Get Away with Murder."
    },
    {
      "verbatim_text": "[02:27:40,302,02:27:44,524] They branded it as TGIT on ABC, which stands for Thank God It's Thursday."
    },
    {
      "verbatim_text": "[02:27:45,527,02:27:51,813] In addition to promoting the shows, ABC encouraged viewers to make popcorn, drink red wine, and enjoy the evening."
    },
    {
      "verbatim_text": "[02:27:58,459,02:28:07,668] We see Thursday night as a viewership opportunity with either couples or women by themselves who want to sit down and escape and have fun and drink their red wine and have some popcorn."
    },
    {
      "verbatim_text": "[02:28:08,839,02:28:20,063] The brilliance of this strategy is that ABC was associating the thing they needed viewers to do, watch their shows, with activities their viewers already wanted to do, relax, drink wine, and eat popcorn."
    },
    {
      "verbatim_text": "[02:28:21,288,02:28:25,911] Over time, people began to connect watching ABC with feeling relaxed and entertained."
    },
    {
      "verbatim_text": "[02:28:26,451,02:28:31,794] If you drink red wine and eat popcorn at 8 p.m. every Thursday, then eventually 8 p.m."
    },
    {
      "verbatim_text": "[02:28:31,834,02:28:34,676] on Thursday means relaxation and entertainment."
    },
    {
      "verbatim_text": "[02:28:35,196,02:28:40,239] The reward gets associated with the cue and the habit of turning on the television becomes more attractive."
    },
    {
      "verbatim_text": "[02:28:41,320,02:28:46,143] You're more likely to find a behavior attractive if you get to do one of your favorite things at the same time."
    },
    {
      "verbatim_text": "[02:29:05,650,02:29:09,773] Temptation Bundling is one way to apply a psychology theory known as Premax Principle."
    },
    {
      "verbatim_text": "[02:29:10,760,02:29:18,182] Named after the work of Professor David Premack, the principle states that more probable behaviors will reinforce less probable behaviors."
    }
  ],
  "start_index": 1368,
  "end_index": 1511
}