{
  "summary": "This chapter discusses how to stick with good habits every day using visual measurements and habit trackers. It introduces Trent Dersmid, a stockbroker who used a paperclip strategy to track his sales calls, moving paperclips from one jar to another after each call, which led to significant success. This 'paperclip strategy' is a visual measure that provides clear evidence of progress. Habit trackers, like calendars where you mark each day you stick to a routine, are also discussed. Benjamin Franklin used a booklet to track his virtues, and Jerry Seinfeld uses a habit tracker for writing jokes. Habit tracking is powerful because it makes a behavior obvious, attractive, and satisfying. It creates visual cues, is motivating due to seeing progress, and feels satisfying to record success. However, tracking can be resisted, and isn't for everyone. To make tracking easier, automate measurement whenever possible, limit manual tracking to important habits, and record measurements immediately after the habit occurs.",
  "evidence": [
    {
      "verbatim_text": "[04:12:18,543,04:12:24,266] In 1993, a bank in Abbotsford, Canada hired a 23-year-old stockbroker named Trent Dersmid."
    },
    {
      "verbatim_text": "[04:12:33,050,04:12:41,074] Given the location and the fact that Dersmid was a rookie, nobody expected too much of him, but he made brisk progress thanks to a simple daily habit."
    },
    {
      "verbatim_text": "[04:12:42,114,04:12:48,875] Dersmid began each morning with two jars on his desk.  One was filled with 120 paperclips. The other was empty."
    },
    {
      "verbatim_text": "[04:12:50,015,04:12:52,696] As soon as he settled in each day, he would make a sales call."
    },
    {
      "verbatim_text": "[04:12:53,356,04:12:59,238] Immediately after, he would move one paperclip from the full jar to the empty jar, and the process would begin again."
    },
    {
      "verbatim_text": "[04:13:08,621,04:13:11,982] Within 18 months, Dersmid was bringing in $5 million to the firm."
    },
    {
      "verbatim_text": "[04:13:24,370,04:13:27,152] I like to refer to this technique as the paperclip strategy."
    },
    {
      "verbatim_text": "[04:13:42,050,04:13:49,414] Making progress is satisfying, and visual measures, like moving paperclips or hairpins or marbles, provide clear evidence of your progress."
    },
    {
      "verbatim_text": "[04:14:11,375,04:14:17,021] How to keep your habits on track. A habit tracker is a simple way to measure whether you did a habit."
    },
    {
      "verbatim_text": "[04:14:33,380,04:14:37,224] Countless people have tracked their habits, but perhaps the most famous was Benjamin Franklin."
    },
    {
      "verbatim_text": "[04:14:37,884,04:14:43,830] Beginning at age 20, Franklin carried a small booklet everywhere he went and used it to track 13 personal virtues."
    },
    {
      "verbatim_text": "[04:14:57,492,04:15:01,196] Jerry Seinfeld reportedly uses a habit tracker to stick with his streak of writing jokes."
    },
    {
      "verbatim_text": "[04:15:32,927,04:15:36,449] Habit tracking is powerful because it leverages multiple laws of behavior change."
    },
    {
      "verbatim_text": "[04:15:36,889,04:15:42,693] It simultaneously makes a behavior obvious, attractive, and satisfying. Let's break down each one."
    },
    {
      "verbatim_text": "[04:16:50,247,04:16:56,671] Benefit number two. Habit tracking is attractive. The most effective form of motivation is progress."
    },
    {
      "verbatim_text": "[04:17:31,641,04:17:37,146] Benefit number three. Habit tracking is satisfying.  This is the most crucial benefit of all."
    },
    {
      "verbatim_text": "[04:18:08,877,04:18:13,681] In summary, Habit Tracking 1. Creates a visual cue that can remind you to act. 2."
    },
    {
      "verbatim_text": "[04:18:14,221,04:18:19,124] Is inherently motivating because you see the progress you are making and don't want to lose it. 3."
    },
    {
      "verbatim_text": "[04:18:19,565,04:18:23,207] Feels satisfying whenever you record another successful instance of your habit."
    },
    {
      "verbatim_text": "[04:19:13,488,04:19:20,575] People inevitably tell me things like, I have a decision journal, but I wish I used it more, or I recorded my workouts for a week, but then quit."
    },
    {
      "verbatim_text": "[04:19:28,592,04:19:31,434] Tracking isn't for everyone, and there's no need to measure your entire life."
    },
    {
      "verbatim_text": "[04:19:36,938,04:19:42,562] So what can we do to make tracking easier? Well, first, whenever possible, measurement should be automated."
    },
    {
      "verbatim_text": "[04:20:04,542,04:20:08,024] Second, manual tracking should be limited to your most important habits."
    },
    {
      "verbatim_text": "[04:20:12,927,04:20:16,789] And finally, record each measurement immediately after the habit occurs."
    }
  ],
  "start_index": 2579,
  "end_index": 2665
}