{
  "summary": "Chapter 20 discusses the downside of creating good habits, noting that while habits form the foundation for mastery and excellence, they can also lead to decreased sensitivity to feedback and mindless repetition. While habits are necessary for mastery, they are not sufficient. A combination of automatic habits and deliberate practice is required to achieve mastery. Therefore, it is important to remain conscious of your performance over time to continue to refine and improve, suggesting a system for reflection and review is needed.",
  "evidence": [
    {
      "verbatim_text": "[05:11:41,945,05:11:50,407] Chapter 20 The Downside of Creating Good Habits Habits create the foundation for mastery."
    },
    {
      "verbatim_text": "[05:11:51,268,05:11:58,149] In chess, it is only after the basic movements of the pieces have become automatic that a player can focus on the next level of the game."
    },
    {
      "verbatim_text": "[05:12:15,185,05:12:22,587] In this way, habits are the backbone of any pursuit of excellence. However, the benefits of habits come at a cost."
    },
    {
      "verbatim_text": "[05:12:27,969,05:12:34,685] But then, as a habit becomes automatic, you become less sensitive to feedback.  you fall into mindless repetition."
    },
    {
      "verbatim_text": "[05:12:47,769,05:12:53,330] The downside of habits is that you get used to doing things a certain way and stop paying attention to little errors."
    },
    {
      "verbatim_text": "[05:13:41,976,05:13:44,798] Habits are necessary but not sufficient for mastery."
    },
    {
      "verbatim_text": "[05:13:45,619,05:13:49,662] What you need is a combination of automatic habits and deliberate practice."
    },
    {
      "verbatim_text": "[05:13:51,023,05:13:54,045] Habits plus deliberate practice equal mastery."
    },
    {
      "verbatim_text": "[05:14:51,060,05:14:58,824] Although habits are powerful, what you need is a way to remain conscious of your performance over time, so you can continue to refine and improve."
    },
    {
      "verbatim_text": "[05:15:11,211,05:15:14,953] The solution? Establish a system for reflection and review."
    }
  ],
  "start_index": 3176,
  "end_index": 3225
}