{
  "summary": "This chapter discusses habits, decisive moments, and the two-minute rule. Twyla Tharp, a renowned dancer and choreographer, attributes her success to simple daily habits, such as hailing a cab to go to the gym. Researchers estimate that 40-50% of daily actions are habits, influencing subsequent conscious decisions. Decisive moments, like choosing between takeout or cooking, significantly impact the day's trajectory and future options. The two-minute rule suggests that new habits should take less than two minutes to start, scaling down larger goals into manageable actions. A new habit should not feel challenging initially, making it easier to establish before optimizing. The key is to standardize habits before attempting to optimize them.",
  "evidence": [
    {
      "verbatim_text": "[03:28:09,251,03:28:13,796] Twyla Tharp is widely regarded as one of the greatest dancers and choreographers of the modern era."
    },
    {
      "verbatim_text": "[03:28:25,476,03:28:31,858] She also credits much of her success to simple daily habits. I begin each day of my life with a ritual, she writes."
    },
    {
      "verbatim_text": "[03:28:32,598,03:28:37,820] I wake up at 5.30 a.m., put on my workout clothes, my leg warmers, my sweatshirt, and my hat."
    },
    {
      "verbatim_text": "[03:28:38,688,03:28:47,478] I walk outside my Manhattan home, hail a taxi, and tell the driver to take me to the Pumping Iron Gym at 91st Street and 1st Avenue, where I work out for two hours."
    },
    {
      "verbatim_text": "[03:28:53,784,03:28:58,750] The ritual is the cab. The moment I tell the driver where to go, I have completed the ritual."
    },
    {
      "verbatim_text": "[03:29:21,908,03:29:26,789] Researchers estimate that 40-50% of our actions on any given day are done out of habit."
    },
    {
      "verbatim_text": "[03:29:34,491,03:29:38,692] Habits are automatic choices that influence the conscious decisions that follow."
    },
    {
      "verbatim_text": "[03:30:41,787,03:30:44,409] If I change my clothes, I know the workout will happen."
    },
    {
      "verbatim_text": "[03:30:54,237,03:30:57,360] Every day there are a handful of moments that deliver an outsized impact."
    },
    {
      "verbatim_text": "[03:30:58,450,03:31:04,995] I refer to these little choices as decisive moments. The moment you decide between ordering takeout or cooking dinner."
    },
    {
      "verbatim_text": "[03:31:16,804,03:31:23,009] The difference between a good day and a bad day is often a few productive and healthy choices made at decisive moments."
    },
    {
      "verbatim_text": "[03:31:24,009,03:31:27,072] Decisive moments set the options available to your future self."
    },
    {
      "verbatim_text": "[03:31:54,081,03:31:57,263] This is why mastering the decisive moments throughout your day is so important."
    },
    {
      "verbatim_text": "[03:32:23,002,03:32:28,923] When you dream about making a change, excitement inevitably takes over and you end up trying to do too much too soon."
    },
    {
      "verbatim_text": "[03:32:30,003,03:32:38,605] The most effective way I know to counteract this tendency is to use the two-minute rule, which states, when you start a new habit, it should take less than two minutes to do."
    },
    {
      "verbatim_text": "[03:32:39,745,03:32:43,126] You'll find that nearly any habit can be scaled down into a two-minute version."
    },
    {
      "verbatim_text": "[03:33:16,075,03:33:17,836] A new habit should not feel like a challenge."
    },
    {
      "verbatim_text": "[03:33:18,376,03:33:22,520] The actions that follow can be challenging, but the first two minutes should be easy."
    },
    {
      "verbatim_text": "[03:34:07,196,03:34:10,617] The truth is, a habit must be established before it can be improved."
    },
    {
      "verbatim_text": "[03:34:22,544,03:34:25,085] You have to standardize before you can optimize."
    }
  ],
  "start_index": 2130,
  "end_index": 2253
}