{
  "summary": "Roger Fisher, a WWII pilot turned Harvard Law School graduate specializing in negotiation and conflict management, founded the Harvard Negotiation Project. In the 1970s and 80s, amidst escalating nuclear war threats, he proposed a strategy where the president, before launching nuclear weapons, would have to kill a volunteer carrying the launch codes, forcing a direct confrontation with the reality of death. This suggestion, while considered terrible by the Pentagon, aimed to make the act of launching nuclear weapons immediately unsatisfying.",
  "evidence": [
    {
      "verbatim_text": "[04:28:14,889,04:28:23,518] After serving as a pilot in World War II, Roger Fisher attended Harvard Law School and spent 34 years specializing in negotiation and conflict management."
    },
    {
      "verbatim_text": "[04:28:24,589,04:28:33,351] He founded the Harvard Negotiation Project and worked with numerous countries and world leaders on peace resolutions, hostage crises, and diplomatic compromises."
    },
    {
      "verbatim_text": "[04:28:34,171,04:28:41,653] But it was in the 1970s and 1980s, as the threat of nuclear war escalated, that Fisher developed perhaps his most interesting idea."
    },
    {
      "verbatim_text": "[04:28:42,953,04:28:49,075] At the time, Fisher was focused on designing strategies that could prevent nuclear war, and he had noticed a troubling fact."
    },
    {
      "verbatim_text": "[04:28:50,181,04:28:58,869] Any sitting president would have access to launch codes that could kill millions of people, but would never actually see anyone die because he would always be thousands of miles away."
    },
    {
      "verbatim_text": "[04:29:00,215,04:29:02,917] My suggestion was quite simple,\" he wrote in 1981."
    },
    {
      "verbatim_text": "[04:29:03,618,04:29:09,602] Put that nuclear code number in a little capsule, and then implant that capsule right next to the heart of a volunteer."
    },
    {
      "verbatim_text": "[04:29:10,303,04:29:14,446] The volunteer would carry with him a big, heavy butcher knife as he accompanied the president."
    },
    {
      "verbatim_text": "[04:29:15,206,04:29:23,093] If ever the president wanted to fire nuclear weapons, the only way he could do so would be for him, first, with his own hands, to kill one human being."
    },
    {
      "verbatim_text": "[04:29:23,813,04:29:27,396] The president says, George, I'm sorry, but tens of millions must die."
    },
    {
      "verbatim_text": "[04:29:28,057,04:29:33,521] He has to look at someone and realize what death is, what an innocent death is, blood on the White House carpet."
    },
    {
      "verbatim_text": "[04:29:34,082,04:29:40,047] It's reality brought home. When I suggested this to friends in the Pentagon, they said, my God, that's terrible."
    },
    {
      "verbatim_text": "[04:29:40,347,04:29:44,070] Having to kill someone would distort the president's judgment. He might never push the button."
    }
  ],
  "start_index": 2749,
  "end_index": 2861
}