{
  "summary": "Chapter 19 introduces the Goldilocks Rule and how to stay motivated. It tells the story of Steve Martin, who started working at Disneyland at age 10. After 15 years, he rose to fame as a comedian. The Goldilocks Rule states that humans experience peak motivation when working on tasks that are right on the edge of their current abilities. Boredom is a major obstacle to self-improvement, and it comes down to who can handle the boredom of training. People desire novelty, and slot machines are a common example of this. To combat boredom, one must learn to 'fall in love with boredom'. Stepping up when it's boring makes the difference between a professional and an amateur. Professionals take action even when the mood isn't right. The Goldilocks rule states that humans experience peak motivation when working on tasks that are right on the edge of their current abilities, and the greatest threat to success is not failure, but boredom. It's the ability to keep going when work isn't exciting that makes the difference. Professionals stick to the schedule.",
  "evidence": [
    {
      "verbatim_text": "[04:59:36,472,04:59:41,357] Chapter 19, The Goldilocks Rule, How to Stay Motivated in Life and Work."
    },
    {
      "verbatim_text": "[04:59:44,310,04:59:51,034] In 1955, Disneyland had just opened in Anaheim, California, when a 10-year-old boy walked in and asked for a job."
    },
    {
      "verbatim_text": "[05:01:16,117,05:01:19,758] Finally, after 15 years of work, the young man rose to fame."
    },
    {
      "verbatim_text": "[05:01:41,233,05:01:42,535] His name is Steve Martin."
    },
    {
      "verbatim_text": "[05:03:24,227,05:03:30,689] The Goldilocks Rule states that humans experience peak motivation when working on tasks that are right on the edge of their current abilities."
    },
    {
      "verbatim_text": "[05:05:04,118,05:05:09,900] Without variety, we get bored, and boredom is perhaps the greatest villain on the quest for self-improvement."
    },
    {
      "verbatim_text": "[05:05:47,830,05:05:54,215] At some point, it comes down to who can handle the boredom of training every day, doing the same lifts over and over and over."
    },
    {
      "verbatim_text": "[05:07:25,436,05:07:32,984] As Machiavelli noted, men desire novelty to such an extent that those who are doing well wish for a change as much as those who are doing badly."
    },
    {
      "verbatim_text": "[05:07:55,152,05:07:57,493] Slot machines are the most common real-world example."
    },
    {
      "verbatim_text": "[05:09:22,820,05:09:24,480] You have to fall in love with boredom."
    },
    {
      "verbatim_text": "[05:09:55,804,05:10:02,587] But stepping up when it's annoying or painful or draining or boring, that's what makes the difference between a professional and an amateur."
    },
    {
      "verbatim_text": "[05:10:33,157,05:10:35,860] Professionals take action even when the mood isn't right."
    },
    {
      "verbatim_text": "[05:11:07,581,05:11:14,245] The Goldilocks rule states that humans experience peak motivation when working on tasks that are right on the edge of their current abilities."
    },
    {
      "verbatim_text": "[05:11:15,586,05:11:18,748] The greatest threat to success is not failure, but boredom."
    },
    {
      "verbatim_text": "[05:11:28,655,05:11:35,139] It's the ability to keep going when work isn't exciting that makes the difference. Professionals stick to the schedule."
    }
  ],
  "start_index": 3042,
  "end_index": 3175
}