{
  "summary": "This chapter discusses two strategies for starting new habits: implementation intentions and habit stacking. An implementation intention involves making a specific plan for when and where a new habit will be performed. In a study, participants who formulated a plan for when and where they would exercise were far more likely to follow through. The format for creating an implementation intention is, \"when situation X arises, I will perform response Y.\" Implementation intentions are effective because they leverage the common cues of time and location. The simple way to apply this strategy is to fill out the sentence: \"I will [behavior] at [time] in [location].\" Being specific helps you say no to distractions. Habit stacking involves identifying a current habit and then stacking the new behavior on top of it. The habit stacking formula is, \"after [current habit], I will [new habit].\" Habit stacking is effective when the cue is highly specific and immediately actionable. Both implementation intentions and habit stacking are practical ways to create obvious cues for your habits and design a clear plan for when and where to take action. When using habit stacking, it is important to select the right cue and consider when you are most likely to be successful. It is also helpful to brainstorm a list of your current habits to find the best place to layer a new habit into your lifestyle.",
  "evidence": [
    {
      "verbatim_text": "[01:34:27,782,01:34:35,286] In 2001, researchers in Great Britain began working with 248 people to build better exercise habits over the course of two weeks."
    },
    {
      "verbatim_text": "[01:34:36,147,01:34:40,337] The subjects were divided into three groups.  The first group was the control group."
    },
    {
      "verbatim_text": "[01:34:40,838,01:34:46,139] They were simply asked to track how often they exercised. The second group was the motivation group."
    },
    {
      "verbatim_text": "[01:34:46,659,01:34:51,681] They were asked not only to track their workouts, but also to read some material on the benefits of exercise."
    },
    {
      "verbatim_text": "[01:34:52,541,01:34:58,142] The researchers also explained to the group how exercise could reduce the risk of coronary heart disease and improve heart health."
    },
    {
      "verbatim_text": "[01:35:01,903,01:35:07,045] These subjects received the same presentation as the second group, which ensured that they had equal levels of motivation."
    },
    {
      "verbatim_text": "[01:35:07,820,01:35:13,262] However, they were also asked to formulate a plan for when and where they would exercise over the following weeks."
    },
    {
      "verbatim_text": "[01:35:14,382,01:35:17,783] Specifically, each member of the third group completed the following sentence."
    },
    {
      "verbatim_text": "[01:35:18,423,01:35:25,785] During the next week, I will partake in at least 20 minutes of vigorous exercise on this day, at this time, in this place."
    },
    {
      "verbatim_text": "[01:35:32,719,01:35:40,262] Interestingly, the motivational presentation given to the second group seemed to have no meaningful impact on the behavior of participants as soon as they left the researchers."
    },
    {
      "verbatim_text": "[01:35:41,262,01:35:46,605] But 91% of the third group exercised at least once per week, more than double the normal rate."
    },
    {
      "verbatim_text": "[01:35:47,898,01:35:56,482] The sentence that they had filled out is what researchers refer to as an implementation intention, which is a plan you make beforehand about when and where to act."
    },
    {
      "verbatim_text": "[01:36:11,388,01:36:18,130] But the two most common cues are time and location.  Implementation intentions leverage both of these cues."
    },
    {
      "verbatim_text": "[01:36:19,530,01:36:39,534] Broadly speaking, the format for creating an implementation intention is, when situation X arises, I will perform response Y. Hundreds of studies have shown that implementation intentions are effective for sticking to our goals, whether it's writing down the exact time and date of when you will get a flu shot or recording the time of your colonoscopy appointment."
    },
    {
      "verbatim_text": "[01:37:11,242,01:37:16,587] People who make a specific plan for when and where they will perform a new habit are more likely to follow through."
    },
    {
      "verbatim_text": "[01:38:12,416,01:38:20,562] The simple way to apply this strategy to your habits is to fill out this sentence. I will behavior at time in location."
    },
    {
      "verbatim_text": "[01:38:58,870,01:39:01,011] There is another benefit to implementation intentions."
    },
    {
      "verbatim_text": "[01:39:01,531,01:39:09,516] Being specific about what you want and how you will achieve it helps you say no to things that can derail your progress, distract your attention, and pull you off course."
    },
    {
      "verbatim_text": "[01:40:02,678,01:40:05,802] Habit stacking, a simple plan to overhaul your habits."
    },
    {
      "verbatim_text": "[01:42:28,000,01:42:35,283] One of the best ways to build a new habit is to identify a current habit that you already do each day and then stack your new behavior on top."
    },
    {
      "verbatim_text": "[01:42:36,054,01:42:41,416] This is what I call habit stacking. Habit stacking is a special form of an implementation intention."
    },
    {
      "verbatim_text": "[01:42:55,983,01:43:04,269] So the habit stacking formula is, after current habit, I will new habit.  For example, meditation."
    },
    {
      "verbatim_text": "[01:43:33,530,01:43:37,532] The key is to tie your desired behavior into something you already do each day."
    },
    {
      "verbatim_text": "[01:43:43,895,01:43:51,019] This allows you to take advantage of the natural momentum that comes from one behavior leading into the next, like a positive version of the Diderot effect."
    },
    {
      "verbatim_text": "[01:45:59,094,01:46:05,517] No matter how you use this strategy, the secret to creating a successful habit stack is selecting the right cue to kick things off."
    },
    {
      "verbatim_text": "[01:46:06,357,01:46:15,441] Unlike an implementation intention, which specifically states the time and location for a given behavior, habit stacking implicitly has a time and location built into it."
    },
    {
      "verbatim_text": "[01:47:48,306,01:47:53,650] Alright, so habit stacking works best when the cue is highly specific and immediately actionable."
    },
    {
      "verbatim_text": "[01:48:52,007,01:49:02,714] Strategies like implementation intentions and habit stacking are among the most practical ways to create obvious cues for your habits and design a clear plan for when and where to take action."
    },
    {
      "verbatim_text": "[01:49:14,456,01:49:20,677] Creating an implementation intention is a strategy you can use to pair a new habit with a specific time and location."
    },
    {
      "verbatim_text": "[01:49:21,717,01:49:28,019] The implementation intention formula is I will behavior at time in location."
    },
    {
      "verbatim_text": "[01:49:29,259,01:49:33,340] Habit stacking is a strategy you can use to pair a new habit with a current habit."
    },
    {
      "verbatim_text": "[01:49:34,140,01:49:38,981] The habit stacking formula is after current habit, I will new habit."
    }
  ],
  "start_index": 961,
  "end_index": 1113
}