{
  "summary": "Chapter 6 of \"Atomic Habits\" focuses on the significant role of environment in shaping behavior, often outweighing motivation. A study by Ann Thorndike altered a hospital cafeteria's choice architecture by increasing the availability of water, leading to a decrease in soda sales and an increase in water consumption. This highlights how environmental cues influence choices. The chapter introduces Kurt Lewin's equation, B=F(P,E), emphasizing that behavior is a function of both the person and their environment. Retail strategies, like placing profitable items at eye level and utilizing end caps, demonstrate how environment drives purchasing decisions. Visual cues are identified as the greatest catalyst for behavior, and redesigning one's environment can promote desired habits. Examples include placing electrical meters in visible locations to reduce energy consumption and using a fly sticker in urinals to improve aim and reduce cleaning costs. Personal anecdotes illustrate how making desired items, like apples, more visible leads to increased consumption. Practical tips are provided for creating obvious cues for desired habits, such as placing medication near the bathroom faucet or a guitar stand in the living room. The chapter stresses the importance of designing environments to increase exposure to positive cues and reduce exposure to negative ones, empowering individuals to take control and become the architects of their lives. It also discusses how habits become associated with specific contexts and how changing environments can facilitate new habits. The chapter suggests creating distinct spaces for different activities to avoid mixing contexts and habits. Even in limited spaces, dividing a room into activity zones or dedicating digital devices to specific tasks can be beneficial. The chapter concludes by emphasizing that stable and predictable environments are conducive to habit formation, with small changes in context leading to significant behavioral changes over time.",
  "evidence": [
    {
      "verbatim_text": "[01:49:43,838,01:49:48,420] Chapter 6, Motivation is Overrated, Environment Often Matters More."
    },
    {
      "verbatim_text": "[01:49:51,201,01:49:56,724] Ann Thorndyke, a primary care physician at Massachusetts General Hospital in Boston, had a crazy idea."
    },
    {
      "verbatim_text": "[01:49:57,884,01:50:05,528] She believed she could improve the eating habits of thousands of hospital staff and visitors without changing their willpower or motivation in the slightest way."
    },
    {
      "verbatim_text": "[01:50:06,288,01:50:08,529] In fact, she didn't plan on talking to them at all."
    },
    {
      "verbatim_text": "[01:50:09,817,01:50:15,478] Thorndike and her colleagues designed a six-month study to alter the choice architecture of the hospital cafeteria."
    },
    {
      "verbatim_text": "[01:50:16,658,01:50:22,379] Originally, the refrigerators located next to the catch registers in the cafeteria were filled with only soda."
    },
    {
      "verbatim_text": "[01:50:23,299,01:50:25,860] The researchers added water as an option to each one."
    },
    {
      "verbatim_text": "[01:50:26,780,01:50:31,121] Additionally, they placed baskets of bottled water next to the food stations throughout the room."
    },
    {
      "verbatim_text": "[01:50:32,361,01:50:37,602] Soda was still in the primary refrigerators, but now water was an option available at all drink locations."
    },
    {
      "verbatim_text": "[01:50:39,144,01:50:42,567] Over the next three months, the number of soda sales at the hospital dropped by 11.4%."
    },
    {
      "verbatim_text": "[01:50:44,688,01:50:47,150] Meanwhile, sales of bottled water increased by 25.8%."
    },
    {
      "verbatim_text": "[01:50:49,352,01:50:53,415] They made similar adjustments and saw similar results with the food in the cafeteria."
    },
    {
      "verbatim_text": "[01:51:06,739,01:51:11,340] People often choose products not because of what they are, but because of where they are."
    },
    {
      "verbatim_text": "[01:51:33,563,01:51:36,345] Environment is the invisible hand that shapes human behavior."
    },
    {
      "verbatim_text": "[01:51:49,856,01:51:55,841] In this way, the most common form of change is not internal, but external. We are changed by the world around us."
    },
    {
      "verbatim_text": "[01:51:56,741,01:51:58,543] Every habit is context-dependent."
    },
    {
      "verbatim_text": "[01:52:00,078,01:52:05,163] In 1936, psychologist Kurt Lewin wrote a simple equation that makes a powerful statement."
    },
    {
      "verbatim_text": "[01:52:05,843,01:52:10,908] Behavior is a function of the person in their environment, or B equals FPE."
    },
    {
      "verbatim_text": "[01:52:15,860,01:52:27,128] In 1952, the economist Hawkins Stern described a phenomenon he called suggestion impulse buying, which is triggered when a shopper sees a product for the first time and visualizes a need for it."
    },
    {
      "verbatim_text": "[01:52:27,909,01:52:34,354] In other words, customers will occasionally buy products not because they want them, but because of how they are presented to them."
    },
    {
      "verbatim_text": "[01:52:35,367,01:52:39,630] For example, items at eye level tend to be purchased more than those down near the floor."
    },
    {
      "verbatim_text": "[01:52:54,462,01:52:59,723] NCAPs are money-making machines for retailers because they are obvious locations that encounter a lot of foot traffic."
    },
    {
      "verbatim_text": "[01:53:00,263,01:53:05,504] For example, 45% of Coca-Cola sales come specifically from end-of-the-aisle racks."
    },
    {
      "verbatim_text": "[01:53:06,685,01:53:11,005] The more obviously available a product or service is, the more likely you are to try it."
    },
    {
      "verbatim_text": "[01:53:23,380,01:53:30,849] The truth, however, is that many of the actions we take each day are shaped not by purposeful drive and choice, but by the most obvious option."
    },
    {
      "verbatim_text": "[01:53:55,357,01:53:58,599] In humans, perception is directed by the sensory nervous system."
    },
    {
      "verbatim_text": "[01:54:27,855,01:54:31,377] The most powerful of all human sensory abilities, however, is vision."
    },
    {
      "verbatim_text": "[01:54:32,238,01:54:38,442] The human body has about 11 million sensory receptors. Approximately 10 million of those are dedicated to sight."
    },
    {
      "verbatim_text": "[01:54:43,505,01:54:50,990] Given that we are more dependent on vision than on any other sense, it should come as no surprise that visual cues are the greatest catalyst of our behavior."
    },
    {
      "verbatim_text": "[01:54:52,102,01:54:56,666] For this reason, a small change in what you see can lead to a big shift in what you do."
    },
    {
      "verbatim_text": "[01:55:11,318,01:55:12,959] You can also be the architect of it."
    },
    {
      "verbatim_text": "[01:55:49,716,01:55:54,280] As you may guess, the homes with the meters located in the main hallway used less electricity."
    },
    {
      "verbatim_text": "[01:55:55,081,01:55:58,484] When their energy was obvious and easy to track, people changed their behavior."
    },
    {
      "verbatim_text": "[01:55:59,749,01:56:04,256] Every habit is initiated by a cue, and we are more likely to notice cues that stand out."
    },
    {
      "verbatim_text": "[01:56:26,360,01:56:30,182] When the cues that spark a habit are subtle or hidden, they're easy to ignore."
    },
    {
      "verbatim_text": "[01:56:31,262,01:56:36,005] By comparison, creating obvious visual cues can draw your attention toward a desired habit."
    },
    {
      "verbatim_text": "[01:56:37,053,01:56:44,735] In the early 1990s, the cleaning staff at Schiphol Airport in Amsterdam installed a small sticker that looked like a fly near the center of each urinal."
    },
    {
      "verbatim_text": "[01:56:45,335,01:56:49,276] Apparently, when men stepped up to the urinals, they aimed for what they thought was a bug."
    },
    {
      "verbatim_text": "[01:56:50,376,01:56:54,377] The stickers improved their aim and significantly reduced spillage around the urinals."
    },
    {
      "verbatim_text": "[01:56:54,957,01:56:58,818] Further analysis determined that the stickers cut bathroom cleaning costs by 8% per year."
    },
    {
      "verbatim_text": "[01:57:00,783,01:57:03,185] I've experienced the power of obvious cues in my own life."
    },
    {
      "verbatim_text": "[01:57:04,006,01:57:08,811] I used to buy apples from the store, put them in the crisper at the bottom of the refrigerator, and forget all about them."
    },
    {
      "verbatim_text": "[01:57:09,412,01:57:13,335] By the time I remembered, the apples would have gone bad. I never saw them, so I never ate them."
    },
    {
      "verbatim_text": "[01:57:14,117,01:57:16,879] Eventually, I took my own advice and redesigned the environment."
    },
    {
      "verbatim_text": "[01:57:17,459,01:57:20,761] I bought a large display bowl and placed it in the middle of the kitchen counter."
    },
    {
      "verbatim_text": "[01:57:21,221,01:57:25,363] The next time I bought apples, that was where they went, out in the open where I could see them."
    },
    {
      "verbatim_text": "[01:57:25,943,01:57:31,046] Almost like magic, I began eating a few apples a day simply because they were obvious rather than out of sight."
    },
    {
      "verbatim_text": "[01:57:32,227,01:57:36,869] Here are a few ways you can redesign your environment and make the cues of your preferred habits more obvious."
    },
    {
      "verbatim_text": "[01:57:38,330,01:57:43,693] If you want to remember to take your medication each night, put your pill bottle directly next to the faucet on your bathroom counter."
    },
    {
      "verbatim_text": "[01:57:44,810,01:57:48,573] If you want to practice guitar more frequently, place your guitar stand in the middle of the living room."
    },
    {
      "verbatim_text": "[01:57:49,774,01:57:53,378] If you want to remember to send more thank you notes, keep a stack of stationery on your desk."
    },
    {
      "verbatim_text": "[01:57:54,118,01:57:59,863] If you want to drink more water, fill up a few water bottles each morning and place them in common locations around the house or the office."
    },
    {
      "verbatim_text": "[01:58:01,245,01:58:05,729] If you want to make a habit a big part of your life, then make the cue a big part of your environment."
    },
    {
      "verbatim_text": "[01:58:06,707,01:58:09,549] The most persistent behaviors usually have multiple cues."
    },
    {
      "verbatim_text": "[01:58:10,109,01:58:17,213] Consider how many different ways a smoker could be prompted to pull out a cigarette, driving the car, seeing a friend smoke, feeling stressed at work, and so on."
    },
    {
      "verbatim_text": "[01:58:18,333,01:58:20,374] The same strategy can be employed for good habits."
    },
    {
      "verbatim_text": "[01:58:20,895,01:58:26,017] By sprinkling triggers throughout your surroundings, you increase the odds that you'll think about your habit throughout the day."
    },
    {
      "verbatim_text": "[01:58:26,978,01:58:29,099] Make sure the best choice is the most obvious one."
    },
    {
      "verbatim_text": "[01:58:29,879,01:58:34,402] Making a better decision is easy and natural when the cues for good habits are right in front of you."
    },
    {
      "verbatim_text": "[01:58:35,961,01:58:41,802] Environment design is powerful, not only because it influences how we engage with the world, but also because we rarely do it."
    },
    {
      "verbatim_text": "[01:58:42,602,01:58:44,923] Most people live in a world others have created for them."
    },
    {
      "verbatim_text": "[01:58:45,643,01:58:52,004] You can alter the spaces where you live and work to increase your exposure to positive cues and reduce your exposure to negative ones."
    },
    {
      "verbatim_text": "[01:58:52,785,01:58:56,705] Environment design allows you to take back control and become the architect of your life."
    },
    {
      "verbatim_text": "[01:58:57,286,01:59:00,246] Be the designer of your world and not merely the consumer of it."
    },
    {
      "verbatim_text": "[01:59:02,447,01:59:03,667] The context is the cue."
    },
    {
      "verbatim_text": "[01:59:05,092,01:59:14,039] The cues that trigger a habit can start out very specific, but over time, your habits become associated not with the single trigger, but with the entire context surrounding the behavior."
    },
    {
      "verbatim_text": "[01:59:14,700,01:59:18,763] For example, many people drink more in social situations than they would ever drink alone."
    },
    {
      "verbatim_text": "[01:59:19,343,01:59:27,049] The trigger is rarely a single cue, but rather the whole situation – watching your friends order drinks, hearing the music at the bar, seeing the beers on tap."
    },
    {
      "verbatim_text": "[01:59:28,010,01:59:33,193] We mentally assign our habits to the locations in which they occur. The home, the office, the gym."
    },
    {
      "verbatim_text": "[01:59:34,134,01:59:37,255] Each location develops a connection to certain habits and routines."
    },
    {
      "verbatim_text": "[01:59:37,756,01:59:43,339] You establish a particular relationship with the objects on your desk, or the items on your kitchen counter, or the things in your bedroom."
    },
    {
      "verbatim_text": "[01:59:44,602,01:59:49,204] Our behavior is not defined by the objects in our environment, but by our relationship to them."
    },
    {
      "verbatim_text": "[01:59:49,784,01:59:53,925] In fact, this is a useful way to think about the influence of environment on your behavior."
    },
    {
      "verbatim_text": "[01:59:54,626,01:59:59,648] Stop thinking about your environment as filled with objects. Start thinking about it as filled with relationships."
    },
    {
      "verbatim_text": "[02:00:00,468,02:00:02,929] Think in terms of how you interact with the spaces around you."
    },
    {
      "verbatim_text": "[02:00:03,869,02:00:07,031] For one person, her couch is the place where she reads for an hour each night."
    },
    {
      "verbatim_text": "[02:00:07,491,02:00:11,814] For someone else, the couch is where he watches television and eats a bowl of ice cream after work."
    },
    {
      "verbatim_text": "[02:00:12,574,02:00:17,197] Different people can have different memories, and thus different habits associated with the same place."
    },
    {
      "verbatim_text": "[02:00:18,198,02:00:23,041] The good news is, you can train yourself to link a particular habit with a particular context."
    },
    {
      "verbatim_text": "[02:00:23,801,02:00:28,764] In one study, scientists instructed insomniacs to get into bed only when they felt tired."
    },
    {
      "verbatim_text": "[02:00:29,364,02:00:33,327] If they couldn't fall asleep, they were told to sit in a different room until they became sleepy."
    },
    {
      "verbatim_text": "[02:00:34,305,02:00:42,693] Over time, the subjects began to associate the context of their bed with the action of sleeping, and it became easier to quickly fall asleep when they climbed in bed."
    },
    {
      "verbatim_text": "[02:00:43,854,02:00:51,261] Their brains learned that sleeping, not browsing their phones or watching television or staring at the clock, was the only action that happened in the room."
    },
    {
      "verbatim_text": "[02:00:52,723,02:00:58,647] The power of context also reveals an important strategy. Habits can be easier to change in a new environment."
    },
    {
      "verbatim_text": "[02:00:59,208,02:01:03,110] It helps to escape the subtle triggers and cues that nudge you toward your current habits."
    },
    {
      "verbatim_text": "[02:01:03,851,02:01:10,235] Go to a new place, a different coffee shop, a bench in the park, a corner of the room that you seldom use, and create a new routine there."
    },
    {
      "verbatim_text": "[02:01:11,216,02:01:17,301] It is easier to associate a new habit with a new context than to build a new habit in the face of competing cues."
    },
    {
      "verbatim_text": "[02:01:18,201,02:01:21,604] It can be difficult to go to bed early if you watch television in your bedroom each night."
    },
    {
      "verbatim_text": "[02:01:22,413,02:01:26,716] It can be hard to study in the living room without getting distracted, if that's where you always play video games."
    },
    {
      "verbatim_text": "[02:01:27,697,02:01:32,001] But when you step outside your normal environment, you leave your behavioral biases behind."
    },
    {
      "verbatim_text": "[02:01:32,681,02:01:37,005] You aren't battling old environmental cues, which allows new habits to form without interruption."
    },
    {
      "verbatim_text": "[02:01:38,125,02:01:43,570] Want to think more creatively? Move to a bigger room, a rooftop patio, or a building with expansive architecture."
    },
    {
      "verbatim_text": "[02:01:44,070,02:01:48,394] Take a break from the space where you do your daily work, which is also linked to your current thought patterns."
    },
    {
      "verbatim_text": "[02:01:49,359,02:01:55,782] Trying to eat healthier? It is likely that you shop on autopilot at your regular supermarket. Try a new grocery store."
    },
    {
      "verbatim_text": "[02:01:56,022,02:02:01,284] You may find it easier to avoid unhealthy food when your brain doesn't automatically know where it is located in the store."
    },
    {
      "verbatim_text": "[02:02:02,724,02:02:07,506] When you can't manage to get to an entirely new environment, redefine or rearrange your current one."
    },
    {
      "verbatim_text": "[02:02:08,507,02:02:12,668] Create a separate space for work, study, exercise, entertainment, and cooking."
    },
    {
      "verbatim_text": "[02:02:13,389,02:02:16,130] The mantra I find useful is one space, one use."
    },
    {
      "verbatim_text": "[02:02:17,419,02:02:21,801] When I started my career as an entrepreneur, I would often work from my couch or at the kitchen table."
    },
    {
      "verbatim_text": "[02:02:22,742,02:02:25,103] In the evenings, I found it very difficult to stop working."
    },
    {
      "verbatim_text": "[02:02:25,383,02:02:29,325] There was no clear division between the end of work time and the beginning of personal time."
    },
    {
      "verbatim_text": "[02:02:29,926,02:02:35,929] Was the kitchen table my office or the space where I ate meals? Was the couch where I relaxed or where I sent emails?"
    },
    {
      "verbatim_text": "[02:02:36,429,02:02:37,770] Everything happened in the same place."
    },
    {
      "verbatim_text": "[02:02:39,248,02:02:43,331] A few years later, I could finally afford to move to a home with a separate room for my office."
    },
    {
      "verbatim_text": "[02:02:43,832,02:02:48,676] Suddenly, work was something that happened in here and personal life was something that happened out there."
    },
    {
      "verbatim_text": "[02:02:49,276,02:02:55,621] It was easier for me to turn off the professional side of my brain when there was a clear dividing line between work life and home life."
    },
    {
      "verbatim_text": "[02:02:56,322,02:03:01,165] Each room had one primary use. The kitchen was for cooking. The office was for working."
    },
    {
      "verbatim_text": "[02:03:02,386,02:03:06,290] Whenever possible, avoid mixing the context of one habit with another."
    },
    {
      "verbatim_text": "[02:03:07,133,02:03:12,135] When you start mixing contexts, you'll start mixing habits, and the easier ones will usually win out."
    },
    {
      "verbatim_text": "[02:03:13,095,02:03:17,777] This is one reason why the versatility of modern technology is both a strength and a weakness."
    },
    {
      "verbatim_text": "[02:03:18,617,02:03:22,179] You can use your phone for all sorts of tasks, which makes it a powerful device."
    },
    {
      "verbatim_text": "[02:03:22,979,02:03:27,681] But when you can use your phone to do nearly anything, it becomes hard to associate it with one task."
    },
    {
      "verbatim_text": "[02:03:28,581,02:03:34,979] You want to be productive, but you're also conditioned to browse social media, check email, and play video games whenever you open your phone."
    },
    {
      "verbatim_text": "[02:03:35,781,02:03:37,044] It's a mishmash of cues."
    },
    {
      "verbatim_text": "[02:03:47,167,02:03:53,569] If your space is limited, divide your room into activity zones, a chair for reading, a desk for writing, a table for eating."
    },
    {
      "verbatim_text": "[02:03:54,129,02:03:55,970] You can do the same with your digital spaces."
    },
    {
      "verbatim_text": "[02:03:56,571,02:04:03,113] I know a writer who uses his computer only for writing, his tablet only for reading, and his phone only for social media and texting."
    },
    {
      "verbatim_text": "[02:04:03,693,02:04:04,774] Every habit should have a home."
    },
    {
      "verbatim_text": "[02:04:06,097,02:04:11,463] If you can manage to stick with this strategy, each context will become associated with a particular habit and mode of thought."
    },
    {
      "verbatim_text": "[02:04:12,063,02:04:14,626] Habits thrive under predictable circumstances like these."
    },
    {
      "verbatim_text": "[02:04:15,387,02:04:18,030] Focus comes automatically when you are sitting at your work desk."
    },
    {
      "verbatim_text": "[02:04:18,290,02:04:21,414] Relaxation is easier when you are in a space designed for that purpose."
    },
    {
      "verbatim_text": "[02:04:22,355,02:04:25,438] Sleep comes quickly when it is the only thing that happens in your bedroom."
    },
    {
      "verbatim_text": "[02:04:26,583,02:04:31,644] If you want behaviors that are stable and predictable, you need an environment that is stable and predictable."
    },
    {
      "verbatim_text": "[02:04:32,825,02:04:37,866] A stable environment where everything has a place and a purpose is an environment where habits can easily form."
    },
    {
      "verbatim_text": "[02:04:40,246,02:04:45,768] Chapter Summary Small changes in context can lead to large changes in behavior over time."
    },
    {
      "verbatim_text": "[02:04:47,028,02:04:51,609] Every habit is initiated by a cue. We are more likely to notice cues that stand out."
    },
    {
      "verbatim_text": "[02:04:52,689,02:04:55,270] Make the cues of good habits obvious in your environment."
    },
    {
      "verbatim_text": "[02:04:56,601,02:05:02,467] Gradually, your habits become associated not with a single trigger, but with the entire context surrounding the behavior."
    },
    {
      "verbatim_text": "[02:05:02,908,02:05:04,449] The context becomes the cue."
    },
    {
      "verbatim_text": "[02:05:05,631,02:05:09,655] It is easier to build new habits in a new environment because you are not fighting old cues."
    }
  ],
  "start_index": 1114,
  "end_index": 1278
}