{
  "summary": "This chapter emphasizes optimizing your environment to facilitate desired actions and hinder undesirable ones. It suggests choosing locations aligned with your daily routines for new habits and reducing friction at home or in the office. The principle of 'addition by subtraction' is introduced, drawing from Japanese manufacturing practices that eliminate wasted effort. Successful companies and governments streamline processes to minimize friction, as seen in meal delivery services, dating apps, ride-sharing, text messaging and the British government's tax collection improvements. Priming the environment involves preparing spaces for their intended purposes, like resetting a room or pre-sorting greeting cards. Conversely, increasing friction can deter bad habits, such as unplugging the TV or hiding your phone. The core idea is to design an environment where the right actions are as easy as possible, aligning with the law of least effort. This includes reducing friction for good habits and increasing it for bad ones, ultimately leading to a life where desired behaviors are the easiest to perform.",
  "evidence": [
    {
      "verbatim_text": "[03:19:08,516,03:19:16,620] In Chapter 6, we discussed environment design as a method for making cues more obvious, but you can also optimize your environment to make actions easier."
    },
    {
      "verbatim_text": "[03:19:17,460,03:19:23,823] For example, when deciding where to practice a new habit, it is best to choose a place that is already along the path of your daily routine."
    },
    {
      "verbatim_text": "[03:19:24,604,03:19:27,425] Habits are easier to build when they fit into the flow of your life."
    },
    {
      "verbatim_text": "[03:19:28,025,03:19:33,328] You are more likely to go to the gym if it's on your way to work because stopping doesn't add much friction to your lifestyle."
    },
    {
      "verbatim_text": "[03:19:34,352,03:19:41,095] By comparison, if the gym is off the path of your normal commute, even by just a few blocks, now you're going out of your way to get there."
    },
    {
      "verbatim_text": "[03:19:42,516,03:19:45,898] Perhaps even more effective is reducing the friction within your home or office."
    },
    {
      "verbatim_text": "[03:19:46,598,03:19:49,460] Too often, we try to start habits in high-friction environments."
    },
    {
      "verbatim_text": "[03:20:01,546,03:20:03,607] We can remove the points of friction that hold us back."
    },
    {
      "verbatim_text": "[03:20:48,585,03:20:51,566] I like to refer to this strategy as addition by subtraction."
    },
    {
      "verbatim_text": "[03:20:52,166,03:20:57,068] The Japanese companies looked for every point of friction in the manufacturing process and eliminated it."
    },
    {
      "verbatim_text": "[03:21:02,190,03:21:07,672] Similarly, when we remove the points of friction that sap our time and energy, we can achieve more with less effort."
    },
    {
      "verbatim_text": "[03:21:17,616,03:21:24,977] If you look at the most habit-forming products, you'll notice that one of the things these goods and services do best is remove little points of friction from your life."
    },
    {
      "verbatim_text": "[03:21:26,067,03:21:28,908] Meal delivery services reduce the friction of shopping for groceries."
    },
    {
      "verbatim_text": "[03:21:29,448,03:21:32,188] Dating apps reduce the friction of making social introductions."
    },
    {
      "verbatim_text": "[03:21:32,828,03:21:35,609] Ride-sharing services reduce the friction of getting across town."
    },
    {
      "verbatim_text": "[03:21:36,229,03:21:39,050] Text messaging reduces the friction of sending a letter in the mail."
    },
    {
      "verbatim_text": "[03:21:40,210,03:21:50,692] Like a Japanese television manufacturer redesigning their workspace to reduce wasted motion, successful companies design their products to automate, eliminate, or simplify as many steps as possible."
    },
    {
      "verbatim_text": "[03:22:29,261,03:22:33,122] Business is a never-ending quest to deliver the same result in an easier fashion."
    },
    {
      "verbatim_text": "[03:22:37,378,03:22:46,359] When the British government wanted to increase tax collection rates, they switched from sending citizens to a web page, where the tax form could be downloaded, to linking directly to the form."
    },
    {
      "verbatim_text": "[03:22:47,280,03:22:53,921] Reducing that one step in the process increased the response rate from 19.2% to 23.4%."
    },
    {
      "verbatim_text": "[03:23:00,271,03:23:04,692] The central idea is to create an environment where doing the right thing is as easy as possible."
    },
    {
      "verbatim_text": "[03:23:05,632,03:23:14,034] Much of the battle of building better habits comes down to finding ways to reduce the friction associated with our good habits and increase the friction associated with our bad ones."
    },
    {
      "verbatim_text": "[03:23:52,353,03:23:58,500] The purpose of resetting each room is not simply to clean up after the last action, but to prepare for the next action."
    },
    {
      "verbatim_text": "[03:24:13,714,03:24:18,899] Whenever you organize a space for its intended purpose, you are priming it to make the next action easy."
    },
    {
      "verbatim_text": "[03:24:31,541,03:24:36,044] She is incredibly good at remembering to send cards because she has reduced the friction of doing so."
    },
    {
      "verbatim_text": "[03:24:51,464,03:24:58,665] If you want to cook a healthy breakfast, place the skillet on the stove, set out the cooking spray on the counter, and lay out any plates and utensils you need the night before."
    },
    {
      "verbatim_text": "[03:25:25,303,03:25:28,504] These are simple ways to make the good habit the path of least resistance."
    },
    {
      "verbatim_text": "[03:25:29,285,03:25:33,467] You can also invert this principle and prime the environment to make bad behaviors difficult."
    },
    {
      "verbatim_text": "[03:25:34,428,03:25:38,550] If you find yourself watching too much television, for example, then unplug it after each use."
    },
    {
      "verbatim_text": "[03:25:43,904,03:25:46,886] This setup creates just enough friction to prevent mindless viewing."
    },
    {
      "verbatim_text": "[03:26:06,037,03:26:08,258] The greater the friction, the less likely to have it."
    },
    {
      "verbatim_text": "[03:26:39,301,03:26:43,067] It is remarkable how little friction is required to prevent unwanted behavior."
    },
    {
      "verbatim_text": "[03:27:02,284,03:27:10,445] Imagine the cumulative impact of making dozens of these changes and living in an environment designed to make the good behaviors easier and the bad behaviors harder."
    },
    {
      "verbatim_text": "[03:27:22,734,03:27:27,638] Redesign your life so the actions that matter most are also the actions that are easiest to do."
    },
    {
      "verbatim_text": "[03:27:33,622,03:27:37,645] We will naturally gravitate toward the option that requires the least amount of work."
    },
    {
      "verbatim_text": "[03:27:38,866,03:27:42,208] Create an environment where doing the right thing is as easy as possible."
    },
    {
      "verbatim_text": "[03:27:43,549,03:27:48,133] Reduce the friction associated with good behaviors. When friction is low, habits are easy."
    },
    {
      "verbatim_text": "[03:27:49,372,03:27:54,017] Increase the friction associated with bad behaviors. When friction is high, habits are difficult."
    },
    {
      "verbatim_text": "[03:27:55,098,03:27:57,720] Prime your environment to make future actions easier."
    }
  ],
  "start_index": 2036,
  "end_index": 2129
}