{
  "summary": "This text emphasizes the power of atomic habits and systems over goals for achieving success. It uses the example of the British cycling team's transformation under Dave Brailsford, who focused on the aggregation of marginal gains, to illustrate how small improvements can lead to significant results. The text argues that habits are the compound interest of self-improvement, with small changes accumulating over time to produce enormous impact. It also warns that bad habits can be a double-edged sword, hindering progress just as easily as good habits can build you up. The text highlights the importance of patience, noting that breakthrough moments are often the result of many previous actions and that there is often a valley of disappointment in the early stages of any quest. It contrasts goals with systems, arguing that while goals are useful for setting a direction, systems are essential for making progress. The text asserts that focusing on systems, rather than goals, is crucial for long-term success, as it addresses the underlying causes of problems and promotes continuous improvement.",
  "evidence": [
    {
      "verbatim_text": "[00:17:40,361,00:17:54,349] The Fundamentals – Why Tiny Changes Make a Big Difference Chapter 1 – The Surprising Power of Atomic Habits The fate of British cycling changed one day in 2003."
    },
    {
      "verbatim_text": "[00:18:04,974,00:18:09,996] At the time, professional cyclists in Great Britain had endured nearly 100 years of mediocrity."
    },
    {
      "verbatim_text": "[00:18:10,957,00:18:15,358] Since 1908, British riders had won just a single gold medal at the Olympic Games."
    },
    {
      "verbatim_text": "[00:18:20,440,00:18:23,922] In 110 years, no British cyclist had ever won the event."
    },
    {
      "verbatim_text": "[00:18:39,238,00:18:42,239] Brailsford had been hired to put British cycling on a new trajectory."
    },
    {
      "verbatim_text": "[00:18:43,179,00:18:50,582] What made him different from previous coaches was his relentless commitment to a strategy that he referred to as the aggregation of marginal gains."
    },
    {
      "verbatim_text": "[00:18:51,638,00:18:55,701] which was the philosophy of searching for a tiny margin of improvement in everything you do."
    },
    {
      "verbatim_text": "[00:18:56,722,00:19:08,292] Brailsford said, the whole principle came from the idea that if you broke down everything you could think of that goes into riding a bike and then improve it by 1%, you will get a significant increase when you put them all together."
    },
    {
      "verbatim_text": "[00:20:16,263,00:20:21,848] As these and hundreds of other small improvements accumulated, the results came faster than anyone could have imagined."
    },
    {
      "verbatim_text": "[00:20:23,019,00:20:34,712] Just five years after Brailsford took over, the British cycling team dominated the road and track cycling events at the 2008 Olympic Games in Beijing, where they won an astounding 60% of the gold medals available."
    },
    {
      "verbatim_text": "[00:20:44,214,00:20:48,257] That same year, Bradley Wiggins became the first British cyclist to win the Tour de France."
    },
    {
      "verbatim_text": "[00:21:01,546,00:21:18,541] During the 10-year span from 2007 to 2017, British cyclists won 178 world championships and 66 Olympic or Paralympic gold medals and captured five Tour de France victories in what is widely regarded as the most successful run in cycling history."
    },
    {
      "verbatim_text": "[00:23:04,432,00:23:06,913] Habits are the compound interest of self-improvement."
    },
    {
      "verbatim_text": "[00:23:13,816,00:23:19,899] They seem to make little difference on any given day, and yet the impact they deliver over the months and years can be enormous."
    },
    {
      "verbatim_text": "[00:23:33,585,00:23:37,328] We often dismiss small changes because they don't seem to matter very much in the moment."
    },
    {
      "verbatim_text": "[00:25:46,247,00:25:50,352] Success is the product of daily habits, not once-in-a-lifetime transformations."
    },
    {
      "verbatim_text": "[00:26:21,390,00:26:26,812] Your outcomes are a lagging measure of your habits. Your net worth is a lagging measure of your financial habits."
    },
    {
      "verbatim_text": "[00:26:32,634,00:26:36,495] Your clutter is a lagging measure of your cleaning habits. You get what you repeat."
    },
    {
      "verbatim_text": "[00:29:08,152,00:29:09,433] Habits are a double-edged sword."
    },
    {
      "verbatim_text": "[00:29:09,933,00:29:15,976] Bad habits can cut you down just as easily as good habits can build you up, which is why understanding the details is crucial."
    },
    {
      "verbatim_text": "[00:30:03,567,00:30:09,650] Breakthrough moments are often the result of many previous actions, which build up the potential required to unleash a major change."
    },
    {
      "verbatim_text": "[00:30:25,999,00:30:32,683] Similarly, habits often appear to make no difference until you cross a critical threshold and unlock a new level of performance."
    },
    {
      "verbatim_text": "[00:30:37,708,00:30:45,637] In the early and middle stages of any quest, there is often a valley of disappointment. You expect to make progress in a linear fashion, and it's frustrating how ineffective changes can seem during the first days, weeks, and even months."
    },
    {
      "verbatim_text": "[00:31:14,388,00:31:22,251] But in order to make a meaningful difference, habits need to persist long enough to break through this plateau, what I call the plateau of latent potential."
    },
    {
      "verbatim_text": "[00:32:53,025,00:33:00,030] Yet, at the 101st blow, it will split in two, and I know it was not the last blow that did it, but all that had gone before."
    },
    {
      "verbatim_text": "[00:33:01,492,00:33:06,656] All big things come from small beginnings. The seed of every habit is a single, tiny decision."
    },
    {
      "verbatim_text": "[00:33:42,337,00:33:44,958] Forget about goals. Focus on systems instead."
    },
    {
      "verbatim_text": "[00:34:33,403,00:34:39,089] Goals are about the results you want to achieve. Systems are about the processes that lead to those results."
    },
    {
      "verbatim_text": "[00:35:44,400,00:35:49,603] The same is true for other areas of life. If you want better results, then forget about setting goals."
    },
    {
      "verbatim_text": "[00:35:50,023,00:35:51,544] Focus on your system instead."
    },
    {
      "verbatim_text": "[00:36:35,675,00:36:42,556] And if successful and unsuccessful people share the same goals, then the goal cannot be what differentiates the winners from the losers."
    },
    {
      "verbatim_text": "[00:37:24,630,00:37:28,252] You're left chasing the same outcome because you never changed the system behind it."
    },
    {
      "verbatim_text": "[00:37:41,588,00:37:45,369] What we really need to change are the systems that cause those results."
    },
    {
      "verbatim_text": "[00:39:41,265,00:39:46,788] The purpose of setting goals is to win the game. The purpose of building systems is to continue playing the game."
    },
    {
      "verbatim_text": "[00:40:11,650,00:40:18,896] Bad habits repeat themselves again and again, not because you don't want to change, but because you have the wrong system for change."
    },
    {
      "verbatim_text": "[00:40:19,856,00:40:24,200] You do not rise to the level of your goals. You fall to the level of your systems."
    },
    {
      "verbatim_text": "[00:40:35,012,00:40:41,594] By now, you have probably realized that an atomic habit refers to a tiny change, a marginal gain, a 1% improvement."
    },
    {
      "verbatim_text": "[00:40:49,537,00:40:55,299] Just as atoms are the building blocks of molecules, atomic habits are the building blocks of remarkable results."
    }
  ],
  "start_index": 171,
  "end_index": 417
}