{
  "summary": "This chapter emphasizes the importance of making habits satisfying to ensure their repetition, highlighting that the human brain is wired to prioritize immediate rewards. Immediate reinforcement is especially useful for habits of avoidance. One strategy to make avoidance visible is to open a savings account for something desired and deposit the money saved from not making a purchase into the account. It is important to select short-term rewards that reinforce your identity rather than conflict with it. Eventually, intrinsic rewards will kick in, and the identity itself becomes the reinforcer. A habit needs to be enjoyable to last, and simple bits of reinforcement can offer the immediate pleasure needed. The fourth law of behavior change is to make it satisfying. The cardinal rule of behavior change is what is immediately rewarded is repeated, and what is immediately punished is avoided. To get a habit to stick, you need to feel immediately successful, even if it's in a small way. The fourth law of behavior change, make it satisfying, increases the odds that a behavior will be repeated next time.",
  "evidence": [
    {
      "verbatim_text": "[04:08:14,260,04:08:20,703] Habit stacking, which we covered in Chapter 5, ties your habit to an immediate cue, which makes it obvious when to start."
    },
    {
      "verbatim_text": "[04:08:21,644,04:08:26,335] Reinforcement ties your habit to an immediate reward, which makes it satisfying when you finish."
    },
    {
      "verbatim_text": "[04:08:27,638,04:08:33,740] Immediate reinforcement can be especially helpful when dealing with habits of avoidance, which are behaviors you want to stop doing."
    },
    {
      "verbatim_text": "[04:08:34,440,04:08:43,844] It can be challenging to stick with habits like no frivolous purchases or no alcohol this month because nothing happens when you skip happy hour drinks or don't buy that pair of shoes."
    },
    {
      "verbatim_text": "[04:08:52,887,04:08:58,342] One solution is to turn this situation on its head.  You want to find a way to make avoidance visible."
    },
    {
      "verbatim_text": "[04:08:59,243,04:09:03,085] Open a savings account and label it for something you want, maybe leather jacket."
    },
    {
      "verbatim_text": "[04:09:03,745,04:09:10,068] Whenever you pass on a purchase, put the same amount of money in the account. Skip your morning latte, transfer $5."
    },
    {
      "verbatim_text": "[04:09:10,549,04:09:15,711] Pass on another month of Netflix, move $10 over. It's like creating a loyalty program for yourself."
    },
    {
      "verbatim_text": "[04:09:16,191,04:09:22,175] The immediate reward of seeing yourself save money toward the leather jacket feels a lot better than just being deprived."
    },
    {
      "verbatim_text": "[04:09:22,595,04:09:28,275] You are making it satisfying to do nothing.  One of my readers and his wife used a similar setup."
    },
    {
      "verbatim_text": "[04:09:28,916,04:09:31,980] They wanted to stop eating out so much and start cooking more together."
    },
    {
      "verbatim_text": "[04:09:32,521,04:09:34,724] They labeled their savings account Trip to Europe."
    },
    {
      "verbatim_text": "[04:09:35,164,04:09:38,629] Whenever they skipped going out to eat, they transferred $50 into the account."
    },
    {
      "verbatim_text": "[04:09:39,150,04:09:41,453] At the end of the year, they put the money toward the vacation."
    },
    {
      "verbatim_text": "[04:09:42,675,04:09:48,998] It is worth noting that it is important to select short-term rewards that reinforce your identity rather than ones that conflict with it."
    },
    {
      "verbatim_text": "[04:09:49,678,04:09:55,621] Buying a new jacket is fine if you're trying to lose weight or read more books, but it doesn't work if you're trying to budget and save money."
    },
    {
      "verbatim_text": "[04:09:56,401,04:10:05,645] Instead, taking a bubble bath or going on a leisurely walk are good examples of rewarding yourself with free time, which aligns with your ultimate goal of more freedom and financial independence."
    },
    {
      "verbatim_text": "[04:10:06,792,04:10:14,278] Similarly, if your reward for exercising is eating a bowl of ice cream, then you're casting votes for conflicting identities, and it ends up being a wash."
    },
    {
      "verbatim_text": "[04:10:14,958,04:10:20,763] Instead, maybe your reward is a massage, which is both a luxury and a vote toward taking care of your body."
    },
    {
      "verbatim_text": "[04:10:21,283,04:10:25,587] Now the short-term reward is aligned with your long-term vision of being a healthy person."
    },
    {
      "verbatim_text": "[04:10:26,988,04:10:34,994] Eventually, as intrinsic rewards like a better mood, more energy, and reduced stress kick in, you'll become less concerned with chasing the secondary reward."
    },
    {
      "verbatim_text": "[04:10:35,811,04:10:41,332] The identity itself becomes the reinforcer. You do it because it's who you are and it feels good to be you."
    },
    {
      "verbatim_text": "[04:10:42,093,04:10:46,534] The more a habit becomes part of your life, the less you need outside encouragement to follow through."
    },
    {
      "verbatim_text": "[04:10:47,254,04:10:50,555] Incentives can start a habit. Identity sustains a habit."
    },
    {
      "verbatim_text": "[04:10:51,535,04:10:55,676] That said, it takes time for the evidence to accumulate and a new identity to emerge."
    },
    {
      "verbatim_text": "[04:10:56,396,04:11:02,098] Immediate reinforcement helps maintain motivation in the short term while you're waiting for the long-term rewards to arrive."
    },
    {
      "verbatim_text": "[04:11:03,135,04:11:06,557] In summary, a habit needs to be enjoyable for it to last."
    },
    {
      "verbatim_text": "[04:11:07,177,04:11:18,242] Simple bits of reinforcement, like soap that smells great, or toothpaste that has a refreshing mint flavor, or seeing $50 hit your savings account, can offer the immediate pleasure you need to enjoy a habit."
    },
    {
      "verbatim_text": "[04:11:18,982,04:11:21,123] And change is easier when it is enjoyable."
    },
    {
      "verbatim_text": "[04:11:23,344,04:11:28,206] Chapter summary. The fourth law of behavior change is make it satisfying."
    },
    {
      "verbatim_text": "[04:11:28,926,04:11:32,508] We are more likely to repeat a behavior when the experience is satisfying."
    },
    {
      "verbatim_text": "[04:11:33,338,04:11:37,960] The human brain evolved to prioritize immediate rewards over delayed rewards."
    },
    {
      "verbatim_text": "[04:11:38,941,04:11:46,005] The cardinal rule of behavior change is, what is immediately rewarded is repeated, what is immediately punished is avoided."
    },
    {
      "verbatim_text": "[04:11:46,985,04:11:51,448] To get a habit to stick, you need to feel immediately successful, even if it's in a small way."
    },
    {
      "verbatim_text": "[04:11:52,474,04:12:00,781] The first three laws of behavior change make it obvious, make it attractive, and make it easy, increase the odds that a behavior will be performed this time."
    },
    {
      "verbatim_text": "[04:12:01,482,04:12:07,588] The fourth law of behavior change make it satisfying, increases the odds that a behavior will be repeated next time."
    }
  ],
  "start_index": 2541,
  "end_index": 2578
}