{
  "summary": "Chapter 18 discusses the truth about talent and how genes influence success. It compares Michael Phelps, a swimmer, and Hickam El Guerrouj, a runner, both exceptional athletes with different body types suited to their sports. Phelps, with a long torso and short legs, is ideal for swimming, while El Guerrouj, with long legs and a short torso, is built for running. It is unlikely Phelps could become an Olympic-caliber distance runner due to his weight. Similarly, El Guerrouj would likely not qualify for the Olympics as a swimmer. The average height of Olympic gold medalists differs significantly between swimming and running. The chapter emphasizes that choosing the right field of competition is crucial for maximizing success and that habits align with natural abilities are easier to maintain. It acknowledges that people are born with different abilities.",
  "evidence": [
    {
      "verbatim_text": "[04:39:59,371,04:40:04,856] Chapter 18, the truth about talent, when genes matter and when they don't."
    },
    {
      "verbatim_text": "[04:40:07,618,04:40:12,803] Many people are familiar with Michael Phelps, who is widely considered to be one of the greatest athletes in history."
    },
    {
      "verbatim_text": "[04:40:13,644,04:40:19,389] Phelps has won more Olympic medals, not only than any swimmer, but also more than any Olympian in any sport."
    },
    {
      "verbatim_text": "[04:40:20,689,04:40:25,712] Fewer people know the name Hickam El Guerrouj, but he was a fantastic athlete in his own right."
    },
    {
      "verbatim_text": "[04:40:26,593,04:40:32,877] El Guerrouj is a Moroccan runner who holds two Olympic gold medals and is one of the greatest middle distance runners of all time."
    },
    {
      "verbatim_text": "[04:40:47,770,04:40:53,513] These two athletes are wildly different in many ways. For starters, one competed on land while the other in water."
    },
    {
      "verbatim_text": "[04:40:54,053,04:40:59,876] But most notably, they differ significantly in height. El Guerrouj is 5 feet 9 inches tall."
    },
    {
      "verbatim_text": "[04:41:00,557,04:41:07,820] Phelps is 6 feet 4 inches tall. Despite this 7 inch difference in height, the two men are identical in one respect."
    },
    {
      "verbatim_text": "[04:41:15,362,04:41:20,424] Phelps has relatively short legs for his height and a very long torso, the perfect build for swimming."
    },
    {
      "verbatim_text": "[04:41:21,364,04:41:26,385] El Grouge has incredibly long legs and a short upper body, an ideal frame for distance running."
    },
    {
      "verbatim_text": "[04:41:38,230,04:41:38,810] It's unlikely."
    },
    {
      "verbatim_text": "[04:41:39,611,04:41:49,275] At peak fitness, Phelps weighed 194 pounds, which is 40% heavier than El Guerrouj, who competed at an ultralight 138 pounds."
    },
    {
      "verbatim_text": "[04:41:50,395,04:41:54,937] Taller runners are heavier runners, and every extra pound is a curse when it comes to distance running."
    },
    {
      "verbatim_text": "[04:41:55,598,04:41:58,699] Against elite competition, Phelps would be doomed from the start."
    },
    {
      "verbatim_text": "[04:41:59,880,04:42:06,783] Similarly, El Guerrouj might be one of the best runners in history, but it's doubtful he would ever qualify for the Olympics as a swimmer."
    },
    {
      "verbatim_text": "[04:42:07,795,04:42:14,802] Since 1976, the average height of Olympic gold medalists in the men's 1,500-meter run is 5 feet, 10 inches."
    },
    {
      "verbatim_text": "[04:42:15,762,04:42:22,248] In comparison, the average height of Olympic gold medalists in the men's 100-meter freestyle swim is 6 feet, 4 inches."
    },
    {
      "verbatim_text": "[04:42:23,329,04:42:28,014] Swimmers tend to be tall and have long backs and arms, which are ideal for pulling through the water."
    },
    {
      "verbatim_text": "[04:42:29,015,04:42:32,378] El Guerrouj would be at a severe disadvantage before he ever touched the pool."
    },
    {
      "verbatim_text": "[04:42:33,860,04:42:38,384] The secret to maximizing your odds of success is to choose the right field of competition."
    },
    {
      "verbatim_text": "[04:42:39,105,04:42:42,768] This is just as true with habit change as it is with sports and business."
    },
    {
      "verbatim_text": "[04:42:43,649,04:42:49,894] Habits are easier to perform and more satisfying to stick with when they align with your natural inclinations and abilities."
    },
    {
      "verbatim_text": "[04:42:50,675,04:42:56,520] Like Michael Phelps in the pool or Hickam El-Ghourouj on the track, you want to play a game where the odds are in your favor."
    },
    {
      "verbatim_text": "[04:42:57,792,04:43:03,015] Embracing this strategy requires the acceptance of the simple truth that people are born with different abilities."
    }
  ],
  "start_index": 2862,
  "end_index": 3041
}