{
  "summary": "This chapter from \"Atomic Habits\" discusses the influence of family, friends, and social norms on shaping habits. It begins with the story of Laszlo Polgar, who believed that genius could be cultivated through deliberate practice, and his experiment to raise his daughters as chess prodigies. He married Clara, who shared his belief in the power of instruction, and together they homeschooled their three daughters, filling their home with chess-related materials and opportunities for competition. All three daughters, Susan, Sophia, and Judith, achieved remarkable success in chess, with Judith becoming the youngest grandmaster of all time and the top-ranked female chess player for 27 years. The chapter then shifts to the broader influence of social norms on behavior, explaining that humans are herd animals who seek to fit in and gain approval. Our earliest habits are often imitated from those around us, and social norms act as invisible rules guiding our behavior. Behaviors become attractive when they help us fit in, and we tend to imitate the habits of those who are close to us, the majority, and those in positions of power.",
  "evidence": [
    {
      "verbatim_text": "[02:31:53,743,02:32:00,207] In 1965, a Hungarian man named Laszlo Polgar wrote a series of strange letters to a woman named Clara."
    },
    {
      "verbatim_text": "[02:32:01,447,02:32:05,770] Laszlo was a firm believer in hard work. In fact, it was all he believed in."
    },
    {
      "verbatim_text": "[02:32:06,350,02:32:08,691] He completely rejected the idea of innate talent."
    },
    {
      "verbatim_text": "[02:32:09,331,02:32:14,814] He claimed that with deliberate practice and the development of good habits, a child could become a genius in any field."
    },
    {
      "verbatim_text": "[02:32:15,415,02:32:19,537] His mantra was, a genius is not born, but is educated and trained."
    },
    {
      "verbatim_text": "[02:32:20,735,02:32:28,841] Laszlo believed in this idea so strongly that he wanted to test it out with his own children, and he was writing to Clara because he needed a wife willing to jump on board."
    },
    {
      "verbatim_text": "[02:32:30,122,02:32:37,547] Clara was a teacher, and although she may not have been as adamant as Laszlo, she also believed that with proper instruction, anyone could advance their skills."
    },
    {
      "verbatim_text": "[02:32:38,708,02:32:45,353] Laszlo decided chess would be a suitable field for the experiment, and he laid out a plan to raise his children to become chess prodigies."
    },
    {
      "verbatim_text": "[02:32:46,281,02:32:49,183] The kids would be homeschooled, a rarity in Hungary at the time."
    },
    {
      "verbatim_text": "[02:32:49,823,02:32:52,905] The house would be filled with chess books and pictures of famous chess players."
    },
    {
      "verbatim_text": "[02:32:53,545,02:32:57,527] The children would play against each other constantly and compete in the best tournaments they could find."
    },
    {
      "verbatim_text": "[02:32:58,688,02:33:03,511] The family would keep a meticulous file system of the tournament history of every competitor the children faced."
    },
    {
      "verbatim_text": "[02:33:04,031,02:33:05,792] Their lives would be dedicated to chess."
    },
    {
      "verbatim_text": "[02:33:07,260,02:33:14,746] Laszlo successfully courted Clara, and within a few years, the Polgars were parents to three young girls, Susan, Sophia, and Judith."
    },
    {
      "verbatim_text": "[02:33:15,727,02:33:21,751] Susan, the oldest, began playing chess when she was four years old. Within six months, she was defeating adults."
    },
    {
      "verbatim_text": "[02:33:22,692,02:33:24,854] Sophia, the middle child, did even better."
    },
    {
      "verbatim_text": "[02:33:25,454,02:33:29,878] By 14, she was a world champion, and a few years later, she became a grandmaster."
    },
    {
      "verbatim_text": "[02:33:31,212,02:33:35,816] Judith, the youngest, was the best of all. By age five, she could beat her father."
    },
    {
      "verbatim_text": "[02:33:36,597,02:33:40,941] At 12, she was the youngest player ever listed among the top 100 chess players in the world."
    },
    {
      "verbatim_text": "[02:33:41,782,02:33:48,928] At 15 years and four months old, she became the youngest grandmaster of all time, younger even than Bobby Fischer, the previous record holder."
    },
    {
      "verbatim_text": "[02:33:49,909,02:33:53,733] For 27 years, she was the number one ranked female chess player in the world."
    },
    {
      "verbatim_text": "[02:33:55,168,02:33:58,630] The childhood of the Polgar sisters was atypical, to say the least."
    },
    {
      "verbatim_text": "[02:33:59,430,02:34:04,453] And yet, if you ask them about it, they claim their lifestyle was attractive, even enjoyable."
    },
    {
      "verbatim_text": "[02:34:05,074,02:34:11,097] In interviews, the sisters talk about their childhood as entertaining rather than grueling. They loved playing chess."
    },
    {
      "verbatim_text": "[02:34:11,197,02:34:12,098] They couldn't get enough of it."
    },
    {
      "verbatim_text": "[02:34:12,942,02:34:16,985] Once, Laszlo reportedly found Sofia playing chess in the bathroom in the middle of the night."
    },
    {
      "verbatim_text": "[02:34:17,745,02:34:21,527] Encouraging her to go back to sleep, he said, Sofia, leave the pieces alone."
    },
    {
      "verbatim_text": "[02:34:22,008,02:34:24,929] To which she replied, Daddy, they won't leave me alone."
    },
    {
      "verbatim_text": "[02:34:26,290,02:34:32,614] The Polgar sisters grew up in a culture that prioritized chess above all else, praised them for it, rewarded them for it."
    },
    {
      "verbatim_text": "[02:34:33,395,02:34:35,796] In their world, an obsession with chess was normal."
    },
    {
      "verbatim_text": "[02:34:36,577,02:34:42,140] And as we are about to see, whatever habits are normal in your culture are among the most attractive behaviors you will find."
    },
    {
      "verbatim_text": "[02:34:44,612,02:34:48,935] The Seductive Pull of Social Norms Humans are herd animals."
    },
    {
      "verbatim_text": "[02:34:49,395,02:34:53,938] We want to fit in, to bond with others, and to earn the respect and approval of our peers."
    },
    {
      "verbatim_text": "[02:34:54,758,02:35:01,162] Such inclinations are essential to our survival. For most of our evolutionary history, our ancestors lived in tribes."
    },
    {
      "verbatim_text": "[02:35:01,762,02:35:06,225] Becoming separated from the tribe, or worse, being cast out, was a death sentence."
    },
    {
      "verbatim_text": "[02:35:06,825,02:35:09,107] The lone wolf dies, but the pack survives."
    },
    {
      "verbatim_text": "[02:35:10,805,02:35:17,350] Meanwhile, those who collaborated and bonded with others enjoyed increased safety, mating opportunities, and access to resources."
    },
    {
      "verbatim_text": "[02:35:18,030,02:35:25,455] As Charles Darwin noted, in the long history of humankind, those who learned to collaborate and improvise most effectively have prevailed."
    },
    {
      "verbatim_text": "[02:35:26,736,02:35:29,658] As a result, one of the deepest human desires is to belong."
    },
    {
      "verbatim_text": "[02:35:30,359,02:35:37,224] And this ancient preference exerts a powerful influence on our modern behavior. We don't choose our earliest habits."
    },
    {
      "verbatim_text": "[02:35:37,644,02:35:38,345] We imitate them."
    },
    {
      "verbatim_text": "[02:35:39,030,02:35:45,652] We follow the script handed down from our friends and family, our church or school, our local community, and society at large."
    },
    {
      "verbatim_text": "[02:35:46,752,02:35:50,813] Each of these cultures and groups comes with its own set of expectations and standards."
    },
    {
      "verbatim_text": "[02:35:51,413,02:35:58,015] When and whether to get married, how many children to have, which holidays to celebrate, how much money to spend on your child's birthday party."
    },
    {
      "verbatim_text": "[02:35:58,815,02:36:03,176] In many ways, these social norms are the invisible rules that guide your behavior each day."
    },
    {
      "verbatim_text": "[02:36:03,996,02:36:07,077] You are always keeping them in mind, even if they are not top of your mind."
    },
    {
      "verbatim_text": "[02:36:08,304,02:36:13,427] Often, you follow the habits of your culture without thinking, without questioning, and sometimes without remembering."
    },
    {
      "verbatim_text": "[02:36:14,068,02:36:19,972] As the French philosopher Michel de Montaigne wrote, the customs and practices of life and society sweep us along."
    },
    {
      "verbatim_text": "[02:36:21,615,02:36:26,298] Most of the time, going along with the group does not feel like a burden. Everyone wants to belong."
    },
    {
      "verbatim_text": "[02:36:26,619,02:36:31,522] If you grow up in a family that rewards you for your chess skills, then playing chess will seem like a very attractive thing to do."
    },
    {
      "verbatim_text": "[02:36:32,163,02:36:37,026] If you work in a job where everyone wears expensive suits, then you'll be inclined to splurge on one as well."
    },
    {
      "verbatim_text": "[02:36:37,787,02:36:43,471] If all of your friends are sharing an inside joke or using a new phrase, you'll want to do it too so that they know that you get it."
    },
    {
      "verbatim_text": "[02:36:44,071,02:36:49,657] Behaviors are attractive when they help us fit in.  In particular, we imitate the habits of three groups."
    },
    {
      "verbatim_text": "[02:36:50,457,02:36:54,198] One, the close. Two, the many. Three, the powerful."
    },
    {
      "verbatim_text": "[02:36:55,318,02:37:00,800] Each group offers an opportunity to leverage the second law of behavior change and make our habits more attractive."
    },
    {
      "verbatim_text": "[02:37:03,220,02:37:08,402] One, imitating the close. Proximity has a powerful effect on our behavior."
    }
  ],
  "start_index": 1534,
  "end_index": 1590
}