{
  "summary": "The discussion focuses on the parallels between the coronavirus pandemic and the HIV pandemic, including governmental responses and societal perceptions. While the coronavirus is presented as universal, it has been marked by associations, such as the \"Chinese virus.\" Artists during the HIV/AIDS crisis innovated to raise awareness and connect people, leading to a sense of community and activism. The art of David Wojnarowicz, an AIDS activist, is highlighted, showing his concerns about resource allocation and cultural negligence. AIDS-related art was an upsurge of political expression and embraced illness as a means of creativity. The ecological consciousness is relevant to understanding the spread of the coronavirus, facilitated by globalization. Art can document and discuss new experiences, reflecting on the value of art and the experiences we're having.",
  "evidence": [
    {
      "verbatim_text": "[00:00:05,279,00:00:10,705] Hello, everyone. Thank you for tuning in to COVID-19, The Humanities Respond."
    },
    {
      "verbatim_text": "[00:00:42,535,00:01:03,936] So today we're going to be talking about how the coronavirus pandemic brings to mind for many people, not just the past flu epidemics like the 1918 pandemic, but also the HIV pandemic of the late 70s, 1980s, and obviously continuing to some extent to the day."
    },
    {
      "verbatim_text": "[00:01:26,286,00:01:40,901] Even just recently, within the last few weeks, Dr. Fauci has himself made overt comment about some of the parallels between the emergence of the AIDS virus in the 80s and the contemporary coronavirus."
    },
    {
      "verbatim_text": "[00:02:26,438,00:02:30,460] There's obviously a big difference in how the two diseases are transmitted."
    },
    {
      "verbatim_text": "[00:03:56,122,00:04:02,985] This virus obviously is being presented as being, you know, sort of universal, everyone's in this together."
    },
    {
      "verbatim_text": "[00:04:57,136,00:05:13,463] Famously, the president marking it as the Chinese virus, for instance, is definitely an attempt to create a sense that the disease comes from a particular set of people and is marked by that association."
    },
    {
      "verbatim_text": "[00:05:39,217,00:06:15,736] So one of the things that I know that you have researched and written about and thought about a lot is the way in which artists and writers that were dealing with the HIV AIDS crisis in their work, you know, basically both took this up as a theme, but also were innovating in various ways in terms of the address and the form and the media of the arts at the time as an important mode of\nboth getting the word out and also helping people to connect in an experiential way with what was going on with people."
    },
    {
      "verbatim_text": "[00:07:30,633,00:07:39,378] Not nostalgia necessarily for the disease itself, but nostalgia for the kinds of community and activism that rose up within the LGBT and queer communities.\nin order to confront it."
    },
    {
      "verbatim_text": "[00:08:03,755,00:08:16,832] Von Arowich was an incredibly outspoken AIDS activist and much of his output as an artist and a writer throughout the 80s was really focused on kind of raising awareness, agitating around HIV,\nand then also documenting his own illness, and he finally died of AIDS-related causes in 1992."
    },
    {
      "verbatim_text": "[00:09:14,839,00:09:20,582] And in fact, Wojnarowicz created this image for a poster for a film about silence equals death in 1989."
    },
    {
      "verbatim_text": "[00:12:30,670,00:12:39,195] Bonaroche became very concerned that the culture was misplacing its resources and not taking care of its citizenry.\nAnd I think if there's anything that really resonates for us today, it is this. Where do we put our resources?"
    },
    {
      "verbatim_text": "[00:13:03,789,00:13:10,973] On the one hand, it was an extraordinary upsurge and exemplary moment of political art"
    },
    {
      "verbatim_text": "[00:13:36,147,00:13:53,852] a kind of extraordinary, almost, I would say, without too much paradox, a kind of almost embrace of illness and mortality as a means of spurring creativity and new forms of expression."
    },
    {
      "verbatim_text": "[00:15:20,896,00:15:36,566] this particular one, a worker not explicitly about HIV, but definitely tied to a larger ecological consciousness and a sense that we need to think about our relationship to the environment very carefully."
    },
    {
      "verbatim_text": "[00:16:11,038,00:16:19,267] So thinking more carefully and critically about our relationship to the environment, ecological awareness will be important.\nin thinking about the spread of these diseases going forward."
    },
    {
      "verbatim_text": "[00:17:22,528,00:17:27,811] They're about people playing together, people enjoying one another.  They're images of joy."
    },
    {
      "verbatim_text": "[00:18:16,162,00:18:27,229] And I wouldn't be surprised if we see more and more of these kinds of experiences being documented and discussed as people are getting used to a new way of experiencing art."
    }
  ]
}